/* automatically generated by rust-bindgen 0.65.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const NVVIOCONFIG_COMPOSITETERMINATE: u32 = 2048;
pub const NVVIOCONFIG_DATAINTEGRITYCHECK: u32 = 4096;
pub const NVVIOCONFIG_CSCOVERRIDE: u32 = 8192;
pub const NVVIOCONFIG_FLIPQUEUELENGTH: u32 = 16384;
pub const NVVIOCONFIG_ANCTIMECODEGENERATION: u32 = 32768;
pub const NVVIOCONFIG_COMPOSITE: u32 = 65536;
pub const NVVIOCONFIG_ALPHAKEYCOMPOSITE: u32 = 131072;
pub const NVVIOCONFIG_COMPOSITE_Y: u32 = 262144;
pub const NVVIOCONFIG_COMPOSITE_CR: u32 = 524288;
pub const NVVIOCONFIG_COMPOSITE_CB: u32 = 1048576;
pub const NVVIOCONFIG_FULL_COLOR_RANGE: u32 = 2097152;
pub const NVVIOCONFIG_RGB_DATA: u32 = 4194304;
pub const NVVIOCONFIG_RESERVED_SDIOUTPUTENABLE: u32 = 8388608;
pub const NVVIOCONFIG_STREAMS: u32 = 16777216;
pub const NVVIOCONFIG_ANC_PARITY_COMPUTATION: u32 = 33554432;
pub const NVVIOCONFIG_ANC_AUDIO_REPEAT: u32 = 67108864;
pub const NVVIOCONFIG_ALLFIELDS: u32 = 134217727;
pub const NVVIOCONFIG_VALIDFIELDS: u32 = 134217727;
pub const NVVIOCONFIG_DRIVERFIELDS: u32 = 16412;
pub const NVVIOCONFIG_GAMMAFIELDS: u32 = 32;
pub const NVVIOCONFIG_RMCTRLFIELDS: u32 = 2039619;
pub const NVVIOCONFIG_RMSKEWFIELDS: u32 = 128;
pub const NVVIOCONFIG_ALLOWSDIRUNNING_FIELDS: u32 = 35631232;
pub const NVVIOCONFIG_RMMODESET_FIELDS: u32 = 67109699;
pub const NVAPI_STEREO_QUADBUFFERED_API_VERSION: u32 = 2;
pub const NVAPI_SETTING_MAX_VALUES: u32 = 100;
pub const NV_GPU_CLIENT_UTIL_DOMAINS_MAX_V1: u32 = 4;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_data_public> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_pctype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_mb_cur_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_lc_codepage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_pointers> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(locinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(mbcinfo)
        )
    );
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    const UNINIT: ::std::mem::MaybeUninit<_Mbstatet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::std::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Wchar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Byte)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._State) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_State)
        )
    );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn __threadid() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __threadhandle() -> usize;
}
pub type NvU64 = ::std::os::raw::c_ulonglong;
pub type NvS64 = ::std::os::raw::c_longlong;
pub type NvS32 = ::std::os::raw::c_int;
pub type NvU32 = ::std::os::raw::c_ulong;
pub type temp_NvU32 = ::std::os::raw::c_ulong;
pub type NvS16 = ::std::os::raw::c_short;
pub type NvU16 = ::std::os::raw::c_ushort;
pub type NvU8 = ::std::os::raw::c_uchar;
pub type NvS8 = ::std::os::raw::c_schar;
pub type NvF32 = f32;
pub type NvF64 = f64;
pub type NvBool = NvU8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_RECT {
    pub left: NvU32,
    pub top: NvU32,
    pub right: NvU32,
    pub bottom: NvU32,
}
#[test]
fn bindgen_test_layout__NV_RECT() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_RECT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_RECT>(),
        16usize,
        concat!("Size of: ", stringify!(_NV_RECT))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_RECT>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_RECT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_RECT),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).top) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_RECT),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).right) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_RECT),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bottom) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_RECT),
            "::",
            stringify!(bottom)
        )
    );
}
pub type NV_RECT = _NV_RECT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvLogicalGpuHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvLogicalGpuHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvLogicalGpuHandle__> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvLogicalGpuHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvLogicalGpuHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvLogicalGpuHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvLogicalGpuHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvLogicalGpuHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvLogicalGpuHandle = *mut NvLogicalGpuHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvPhysicalGpuHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvPhysicalGpuHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvPhysicalGpuHandle__> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvPhysicalGpuHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvPhysicalGpuHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvPhysicalGpuHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvPhysicalGpuHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvPhysicalGpuHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvPhysicalGpuHandle = *mut NvPhysicalGpuHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvDisplayHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvDisplayHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvDisplayHandle__> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvDisplayHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvDisplayHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvDisplayHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvDisplayHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvDisplayHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvDisplayHandle = *mut NvDisplayHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvMonitorHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvMonitorHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvMonitorHandle__> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvMonitorHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvMonitorHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvMonitorHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvMonitorHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvMonitorHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvMonitorHandle = *mut NvMonitorHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvUnAttachedDisplayHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvUnAttachedDisplayHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvUnAttachedDisplayHandle__> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvUnAttachedDisplayHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvUnAttachedDisplayHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvUnAttachedDisplayHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvUnAttachedDisplayHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvUnAttachedDisplayHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvUnAttachedDisplayHandle = *mut NvUnAttachedDisplayHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvVisualComputingDeviceHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvVisualComputingDeviceHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvVisualComputingDeviceHandle__> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvVisualComputingDeviceHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvVisualComputingDeviceHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvVisualComputingDeviceHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvVisualComputingDeviceHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvVisualComputingDeviceHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvVisualComputingDeviceHandle = *mut NvVisualComputingDeviceHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvEventHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvEventHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvEventHandle__> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvEventHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvEventHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvEventHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvEventHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvEventHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvEventHandle = *mut NvEventHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvHICHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvHICHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvHICHandle__> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvHICHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvHICHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvHICHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvHICHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvHICHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvHICHandle = *mut NvHICHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvGSyncDeviceHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvGSyncDeviceHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvGSyncDeviceHandle__> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvGSyncDeviceHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvGSyncDeviceHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvGSyncDeviceHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvGSyncDeviceHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvGSyncDeviceHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvGSyncDeviceHandle = *mut NvGSyncDeviceHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvVioHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvVioHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvVioHandle__> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvVioHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvVioHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvVioHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvVioHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvVioHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvVioHandle = *mut NvVioHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvTransitionHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvTransitionHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvTransitionHandle__> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvTransitionHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvTransitionHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvTransitionHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvTransitionHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvTransitionHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvTransitionHandle = *mut NvTransitionHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvAudioHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvAudioHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvAudioHandle__> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvAudioHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvAudioHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvAudioHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvAudioHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvAudioHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvAudioHandle = *mut NvAudioHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Nv3DVPContextHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Nv3DVPContextHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<Nv3DVPContextHandle__> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Nv3DVPContextHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(Nv3DVPContextHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<Nv3DVPContextHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(Nv3DVPContextHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Nv3DVPContextHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type Nv3DVPContextHandle = *mut Nv3DVPContextHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Nv3DVPTransceiverHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Nv3DVPTransceiverHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<Nv3DVPTransceiverHandle__> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Nv3DVPTransceiverHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(Nv3DVPTransceiverHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<Nv3DVPTransceiverHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(Nv3DVPTransceiverHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Nv3DVPTransceiverHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type Nv3DVPTransceiverHandle = *mut Nv3DVPTransceiverHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Nv3DVPGlassesHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Nv3DVPGlassesHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<Nv3DVPGlassesHandle__> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Nv3DVPGlassesHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(Nv3DVPGlassesHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<Nv3DVPGlassesHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(Nv3DVPGlassesHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Nv3DVPGlassesHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type Nv3DVPGlassesHandle = *mut Nv3DVPGlassesHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvPcfClientHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvPcfClientHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvPcfClientHandle__> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvPcfClientHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvPcfClientHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvPcfClientHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvPcfClientHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvPcfClientHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvPcfClientHandle = *mut NvPcfClientHandle__;
pub type StereoHandle = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvSourceHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvSourceHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvSourceHandle__> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvSourceHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvSourceHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvSourceHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvSourceHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvSourceHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvSourceHandle = *mut NvSourceHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvTargetHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvTargetHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvTargetHandle__> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvTargetHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvTargetHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvTargetHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvTargetHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvTargetHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvTargetHandle = *mut NvTargetHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVDX_SwapChainHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NVDX_SwapChainHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NVDX_SwapChainHandle__> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVDX_SwapChainHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NVDX_SwapChainHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NVDX_SwapChainHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NVDX_SwapChainHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NVDX_SwapChainHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NVDX_SwapChainHandle = *mut NVDX_SwapChainHandle__;
extern "C" {
    pub static NVDX_SWAPCHAIN_NONE: NVDX_SwapChainHandle;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvPresentBarrierClientHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvPresentBarrierClientHandle__() {
    const UNINIT: ::std::mem::MaybeUninit<NvPresentBarrierClientHandle__> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvPresentBarrierClientHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvPresentBarrierClientHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvPresentBarrierClientHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvPresentBarrierClientHandle__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvPresentBarrierClientHandle__),
            "::",
            stringify!(unused)
        )
    );
}
pub type NvPresentBarrierClientHandle = *mut NvPresentBarrierClientHandle__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvSBox {
    pub sX: NvS32,
    pub sY: NvS32,
    pub sWidth: NvS32,
    pub sHeight: NvS32,
}
#[test]
fn bindgen_test_layout_NvSBox() {
    const UNINIT: ::std::mem::MaybeUninit<NvSBox> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvSBox>(),
        16usize,
        concat!("Size of: ", stringify!(NvSBox))
    );
    assert_eq!(
        ::std::mem::align_of::<NvSBox>(),
        4usize,
        concat!("Alignment of ", stringify!(NvSBox))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sX) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvSBox),
            "::",
            stringify!(sX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sY) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NvSBox),
            "::",
            stringify!(sY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sWidth) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NvSBox),
            "::",
            stringify!(sWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sHeight) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NvSBox),
            "::",
            stringify!(sHeight)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NvGUID {
    pub data1: NvU32,
    pub data2: NvU16,
    pub data3: NvU16,
    pub data4: [NvU8; 8usize],
}
#[test]
fn bindgen_test_layout_NvGUID() {
    const UNINIT: ::std::mem::MaybeUninit<NvGUID> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NvGUID>(),
        16usize,
        concat!("Size of: ", stringify!(NvGUID))
    );
    assert_eq!(
        ::std::mem::align_of::<NvGUID>(),
        4usize,
        concat!("Alignment of ", stringify!(NvGUID))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NvGUID),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NvGUID),
            "::",
            stringify!(data2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data3) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(NvGUID),
            "::",
            stringify!(data3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data4) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NvGUID),
            "::",
            stringify!(data4)
        )
    );
}
pub type NvLUID = NvGUID;
pub type NvAPI_String = [::std::os::raw::c_char; 4096usize];
pub type NvAPI_LongString = [::std::os::raw::c_char; 256usize];
pub type NvAPI_ShortString = [::std::os::raw::c_char; 64usize];
pub type NvAPI_UnicodeShortString = [NvU16; 64usize];
#[doc = "!< Success. Request is completed."]
pub const _NvAPI_Status_NVAPI_OK: _NvAPI_Status = 0;
#[doc = "!< Generic error"]
pub const _NvAPI_Status_NVAPI_ERROR: _NvAPI_Status = -1;
#[doc = "!< NVAPI support library cannot be loaded."]
pub const _NvAPI_Status_NVAPI_LIBRARY_NOT_FOUND: _NvAPI_Status = -2;
#[doc = "!< not implemented in current driver installation"]
pub const _NvAPI_Status_NVAPI_NO_IMPLEMENTATION: _NvAPI_Status = -3;
#[doc = "!< NvAPI_Initialize has not been called (successfully)"]
pub const _NvAPI_Status_NVAPI_API_NOT_INITIALIZED: _NvAPI_Status = -4;
#[doc = "!< The argument/parameter value is not valid or NULL."]
pub const _NvAPI_Status_NVAPI_INVALID_ARGUMENT: _NvAPI_Status = -5;
#[doc = "!< No NVIDIA display driver, or NVIDIA GPU driving a display, was found."]
pub const _NvAPI_Status_NVAPI_NVIDIA_DEVICE_NOT_FOUND: _NvAPI_Status = -6;
#[doc = "!< No more items to enumerate"]
pub const _NvAPI_Status_NVAPI_END_ENUMERATION: _NvAPI_Status = -7;
#[doc = "!< Invalid handle"]
pub const _NvAPI_Status_NVAPI_INVALID_HANDLE: _NvAPI_Status = -8;
#[doc = "!< An argument's structure version is not supported"]
pub const _NvAPI_Status_NVAPI_INCOMPATIBLE_STRUCT_VERSION: _NvAPI_Status = -9;
#[doc = "!< The handle is no longer valid (likely due to GPU or display re-configuration)"]
pub const _NvAPI_Status_NVAPI_HANDLE_INVALIDATED: _NvAPI_Status = -10;
#[doc = "!< No NVIDIA OpenGL context is current (but needs to be)"]
pub const _NvAPI_Status_NVAPI_OPENGL_CONTEXT_NOT_CURRENT: _NvAPI_Status = -11;
#[doc = "!< An invalid pointer, usually NULL, was passed as a parameter"]
pub const _NvAPI_Status_NVAPI_INVALID_POINTER: _NvAPI_Status = -14;
#[doc = "!< OpenGL Expert is not supported by the current drivers"]
pub const _NvAPI_Status_NVAPI_NO_GL_EXPERT: _NvAPI_Status = -12;
#[doc = "!< OpenGL Expert is supported, but driver instrumentation is currently disabled"]
pub const _NvAPI_Status_NVAPI_INSTRUMENTATION_DISABLED: _NvAPI_Status = -13;
#[doc = "!< OpenGL does not support Nsight"]
pub const _NvAPI_Status_NVAPI_NO_GL_NSIGHT: _NvAPI_Status = -15;
#[doc = "!< Expected a logical GPU handle for one or more parameters"]
pub const _NvAPI_Status_NVAPI_EXPECTED_LOGICAL_GPU_HANDLE: _NvAPI_Status = -100;
#[doc = "!< Expected a physical GPU handle for one or more parameters"]
pub const _NvAPI_Status_NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE: _NvAPI_Status = -101;
#[doc = "!< Expected an NV display handle for one or more parameters"]
pub const _NvAPI_Status_NVAPI_EXPECTED_DISPLAY_HANDLE: _NvAPI_Status = -102;
#[doc = "!< The combination of parameters is not valid."]
pub const _NvAPI_Status_NVAPI_INVALID_COMBINATION: _NvAPI_Status = -103;
#[doc = "!< Requested feature is not supported in the selected GPU"]
pub const _NvAPI_Status_NVAPI_NOT_SUPPORTED: _NvAPI_Status = -104;
#[doc = "!< No port ID was found for the I2C transaction"]
pub const _NvAPI_Status_NVAPI_PORTID_NOT_FOUND: _NvAPI_Status = -105;
#[doc = "!< Expected an unattached display handle as one of the input parameters."]
pub const _NvAPI_Status_NVAPI_EXPECTED_UNATTACHED_DISPLAY_HANDLE: _NvAPI_Status = -106;
#[doc = "!< Invalid perf level"]
pub const _NvAPI_Status_NVAPI_INVALID_PERF_LEVEL: _NvAPI_Status = -107;
#[doc = "!< Device is busy; request not fulfilled"]
pub const _NvAPI_Status_NVAPI_DEVICE_BUSY: _NvAPI_Status = -108;
#[doc = "!< NV persist file is not found"]
pub const _NvAPI_Status_NVAPI_NV_PERSIST_FILE_NOT_FOUND: _NvAPI_Status = -109;
#[doc = "!< NV persist data is not found"]
pub const _NvAPI_Status_NVAPI_PERSIST_DATA_NOT_FOUND: _NvAPI_Status = -110;
#[doc = "!< Expected a TV output display"]
pub const _NvAPI_Status_NVAPI_EXPECTED_TV_DISPLAY: _NvAPI_Status = -111;
#[doc = "!< Expected a TV output on the D Connector - HDTV_EIAJ4120."]
pub const _NvAPI_Status_NVAPI_EXPECTED_TV_DISPLAY_ON_DCONNECTOR: _NvAPI_Status = -112;
#[doc = "!< SLI is not active on this device."]
pub const _NvAPI_Status_NVAPI_NO_ACTIVE_SLI_TOPOLOGY: _NvAPI_Status = -113;
#[doc = "!< Setup of SLI rendering mode is not possible right now."]
pub const _NvAPI_Status_NVAPI_SLI_RENDERING_MODE_NOTALLOWED: _NvAPI_Status = -114;
#[doc = "!< Expected a digital flat panel."]
pub const _NvAPI_Status_NVAPI_EXPECTED_DIGITAL_FLAT_PANEL: _NvAPI_Status = -115;
#[doc = "!< Argument exceeds the expected size."]
pub const _NvAPI_Status_NVAPI_ARGUMENT_EXCEED_MAX_SIZE: _NvAPI_Status = -116;
#[doc = "!< Inhibit is ON due to one of the flags in NV_GPU_DISPLAY_CHANGE_INHIBIT or SLI active."]
pub const _NvAPI_Status_NVAPI_DEVICE_SWITCHING_NOT_ALLOWED: _NvAPI_Status = -117;
#[doc = "!< Testing of clocks is not supported."]
pub const _NvAPI_Status_NVAPI_TESTING_CLOCKS_NOT_SUPPORTED: _NvAPI_Status = -118;
#[doc = "!< The specified underscan config is from an unknown source (e.g. INF)"]
pub const _NvAPI_Status_NVAPI_UNKNOWN_UNDERSCAN_CONFIG: _NvAPI_Status = -119;
#[doc = "!< Timeout while reconfiguring GPUs"]
pub const _NvAPI_Status_NVAPI_TIMEOUT_RECONFIGURING_GPU_TOPO: _NvAPI_Status = -120;
#[doc = "!< Requested data was not found"]
pub const _NvAPI_Status_NVAPI_DATA_NOT_FOUND: _NvAPI_Status = -121;
#[doc = "!< Expected an analog display"]
pub const _NvAPI_Status_NVAPI_EXPECTED_ANALOG_DISPLAY: _NvAPI_Status = -122;
#[doc = "!< No SLI video bridge is present"]
pub const _NvAPI_Status_NVAPI_NO_VIDLINK: _NvAPI_Status = -123;
#[doc = "!< NVAPI requires a reboot for the settings to take effect"]
pub const _NvAPI_Status_NVAPI_REQUIRES_REBOOT: _NvAPI_Status = -124;
#[doc = "!< The function is not supported with the current Hybrid mode."]
pub const _NvAPI_Status_NVAPI_INVALID_HYBRID_MODE: _NvAPI_Status = -125;
#[doc = "!< The target types are not all the same"]
pub const _NvAPI_Status_NVAPI_MIXED_TARGET_TYPES: _NvAPI_Status = -126;
#[doc = "!< The function is not supported from 32-bit on a 64-bit system."]
pub const _NvAPI_Status_NVAPI_SYSWOW64_NOT_SUPPORTED: _NvAPI_Status = -127;
#[doc = "!< There is no implicit GPU topology active. Use NVAPI_SetHybridMode to change topology."]
pub const _NvAPI_Status_NVAPI_IMPLICIT_SET_GPU_TOPOLOGY_CHANGE_NOT_ALLOWED: _NvAPI_Status = -128;
#[doc = "!< Prompt the user to close all non-migratable applications."]
pub const _NvAPI_Status_NVAPI_REQUEST_USER_TO_CLOSE_NON_MIGRATABLE_APPS: _NvAPI_Status = -129;
#[doc = "!< Could not allocate sufficient memory to complete the call."]
pub const _NvAPI_Status_NVAPI_OUT_OF_MEMORY: _NvAPI_Status = -130;
#[doc = "!< The previous operation that is transferring information to or from this surface is incomplete."]
pub const _NvAPI_Status_NVAPI_WAS_STILL_DRAWING: _NvAPI_Status = -131;
#[doc = "!< The file was not found."]
pub const _NvAPI_Status_NVAPI_FILE_NOT_FOUND: _NvAPI_Status = -132;
#[doc = "!< There are too many unique instances of a particular type of state object."]
pub const _NvAPI_Status_NVAPI_TOO_MANY_UNIQUE_STATE_OBJECTS: _NvAPI_Status = -133;
#[doc = "!< The method call is invalid. For example, a method's parameter may not be a valid pointer."]
pub const _NvAPI_Status_NVAPI_INVALID_CALL: _NvAPI_Status = -134;
#[doc = "!< d3d10_1.dll cannot be loaded."]
pub const _NvAPI_Status_NVAPI_D3D10_1_LIBRARY_NOT_FOUND: _NvAPI_Status = -135;
#[doc = "!< Couldn't find the function in the loaded DLL."]
pub const _NvAPI_Status_NVAPI_FUNCTION_NOT_FOUND: _NvAPI_Status = -136;
#[doc = "!< The application will require Administrator privileges to access this API.\n!< The application can be elevated to a higher permission level by selecting \"Run as Administrator\"."]
pub const _NvAPI_Status_NVAPI_INVALID_USER_PRIVILEGE: _NvAPI_Status = -137;
#[doc = "!< The handle corresponds to GDIPrimary."]
pub const _NvAPI_Status_NVAPI_EXPECTED_NON_PRIMARY_DISPLAY_HANDLE: _NvAPI_Status = -138;
#[doc = "!< Setting Physx GPU requires that the GPU is compute-capable."]
pub const _NvAPI_Status_NVAPI_EXPECTED_COMPUTE_GPU_HANDLE: _NvAPI_Status = -139;
#[doc = "!< The Stereo part of NVAPI failed to initialize completely. Check if the stereo driver is installed."]
pub const _NvAPI_Status_NVAPI_STEREO_NOT_INITIALIZED: _NvAPI_Status = -140;
#[doc = "!< Access to stereo-related registry keys or values has failed."]
pub const _NvAPI_Status_NVAPI_STEREO_REGISTRY_ACCESS_FAILED: _NvAPI_Status = -141;
#[doc = "!< The given registry profile type is not supported."]
pub const _NvAPI_Status_NVAPI_STEREO_REGISTRY_PROFILE_TYPE_NOT_SUPPORTED: _NvAPI_Status = -142;
#[doc = "!< The given registry value is not supported."]
pub const _NvAPI_Status_NVAPI_STEREO_REGISTRY_VALUE_NOT_SUPPORTED: _NvAPI_Status = -143;
#[doc = "!< Stereo is not enabled and the function needed it to execute completely."]
pub const _NvAPI_Status_NVAPI_STEREO_NOT_ENABLED: _NvAPI_Status = -144;
#[doc = "!< Stereo is not turned on and the function needed it to execute completely."]
pub const _NvAPI_Status_NVAPI_STEREO_NOT_TURNED_ON: _NvAPI_Status = -145;
#[doc = "!< Invalid device interface."]
pub const _NvAPI_Status_NVAPI_STEREO_INVALID_DEVICE_INTERFACE: _NvAPI_Status = -146;
#[doc = "!< Separation percentage or JPEG image capture quality is out of [0-100] range."]
pub const _NvAPI_Status_NVAPI_STEREO_PARAMETER_OUT_OF_RANGE: _NvAPI_Status = -147;
#[doc = "!< The given frustum adjust mode is not supported."]
pub const _NvAPI_Status_NVAPI_STEREO_FRUSTUM_ADJUST_MODE_NOT_SUPPORTED: _NvAPI_Status = -148;
#[doc = "!< The mosaic topology is not possible given the current state of the hardware."]
pub const _NvAPI_Status_NVAPI_TOPO_NOT_POSSIBLE: _NvAPI_Status = -149;
#[doc = "!< An attempt to do a display resolution mode change has failed."]
pub const _NvAPI_Status_NVAPI_MODE_CHANGE_FAILED: _NvAPI_Status = -150;
#[doc = "!< d3d11.dll/d3d11_beta.dll cannot be loaded."]
pub const _NvAPI_Status_NVAPI_D3D11_LIBRARY_NOT_FOUND: _NvAPI_Status = -151;
#[doc = "!< Address is outside of valid range."]
pub const _NvAPI_Status_NVAPI_INVALID_ADDRESS: _NvAPI_Status = -152;
#[doc = "!< The pre-allocated string is too small to hold the result."]
pub const _NvAPI_Status_NVAPI_STRING_TOO_SMALL: _NvAPI_Status = -153;
#[doc = "!< The input does not match any of the available devices."]
pub const _NvAPI_Status_NVAPI_MATCHING_DEVICE_NOT_FOUND: _NvAPI_Status = -154;
#[doc = "!< Driver is running."]
pub const _NvAPI_Status_NVAPI_DRIVER_RUNNING: _NvAPI_Status = -155;
#[doc = "!< Driver is not running."]
pub const _NvAPI_Status_NVAPI_DRIVER_NOTRUNNING: _NvAPI_Status = -156;
#[doc = "!< A driver reload is required to apply these settings."]
pub const _NvAPI_Status_NVAPI_ERROR_DRIVER_RELOAD_REQUIRED: _NvAPI_Status = -157;
#[doc = "!< Intended setting is not allowed."]
pub const _NvAPI_Status_NVAPI_SET_NOT_ALLOWED: _NvAPI_Status = -158;
#[doc = "!< Information can't be returned due to \"advanced display topology\"."]
pub const _NvAPI_Status_NVAPI_ADVANCED_DISPLAY_TOPOLOGY_REQUIRED: _NvAPI_Status = -159;
#[doc = "!< Setting is not found."]
pub const _NvAPI_Status_NVAPI_SETTING_NOT_FOUND: _NvAPI_Status = -160;
#[doc = "!< Setting size is too large."]
pub const _NvAPI_Status_NVAPI_SETTING_SIZE_TOO_LARGE: _NvAPI_Status = -161;
#[doc = "!< There are too many settings for a profile."]
pub const _NvAPI_Status_NVAPI_TOO_MANY_SETTINGS_IN_PROFILE: _NvAPI_Status = -162;
#[doc = "!< Profile is not found."]
pub const _NvAPI_Status_NVAPI_PROFILE_NOT_FOUND: _NvAPI_Status = -163;
#[doc = "!< Profile name is duplicated."]
pub const _NvAPI_Status_NVAPI_PROFILE_NAME_IN_USE: _NvAPI_Status = -164;
#[doc = "!< Profile name is empty."]
pub const _NvAPI_Status_NVAPI_PROFILE_NAME_EMPTY: _NvAPI_Status = -165;
#[doc = "!< Application not found in the Profile."]
pub const _NvAPI_Status_NVAPI_EXECUTABLE_NOT_FOUND: _NvAPI_Status = -166;
#[doc = "!< Application already exists in the other profile."]
pub const _NvAPI_Status_NVAPI_EXECUTABLE_ALREADY_IN_USE: _NvAPI_Status = -167;
#[doc = "!< Data Type mismatch"]
pub const _NvAPI_Status_NVAPI_DATATYPE_MISMATCH: _NvAPI_Status = -168;
#[doc = "!< The profile passed as parameter has been removed and is no longer valid."]
pub const _NvAPI_Status_NVAPI_PROFILE_REMOVED: _NvAPI_Status = -169;
#[doc = "!< An unregistered resource was passed as a parameter."]
pub const _NvAPI_Status_NVAPI_UNREGISTERED_RESOURCE: _NvAPI_Status = -170;
#[doc = "!< The DisplayId corresponds to a display which is not within the normal outputId range."]
pub const _NvAPI_Status_NVAPI_ID_OUT_OF_RANGE: _NvAPI_Status = -171;
#[doc = "!< Display topology is not valid so the driver cannot do a mode set on this configuration."]
pub const _NvAPI_Status_NVAPI_DISPLAYCONFIG_VALIDATION_FAILED: _NvAPI_Status = -172;
#[doc = "!< Display Port Multi-Stream topology has been changed."]
pub const _NvAPI_Status_NVAPI_DPMST_CHANGED: _NvAPI_Status = -173;
#[doc = "!< Input buffer is insufficient to hold the contents."]
pub const _NvAPI_Status_NVAPI_INSUFFICIENT_BUFFER: _NvAPI_Status = -174;
#[doc = "!< No access to the caller."]
pub const _NvAPI_Status_NVAPI_ACCESS_DENIED: _NvAPI_Status = -175;
#[doc = "!< The requested action cannot be performed without Mosaic being enabled."]
pub const _NvAPI_Status_NVAPI_MOSAIC_NOT_ACTIVE: _NvAPI_Status = -176;
#[doc = "!< The surface is relocated away from video memory."]
pub const _NvAPI_Status_NVAPI_SHARE_RESOURCE_RELOCATED: _NvAPI_Status = -177;
#[doc = "!< The user should disable DWM before calling NvAPI."]
pub const _NvAPI_Status_NVAPI_REQUEST_USER_TO_DISABLE_DWM: _NvAPI_Status = -178;
#[doc = "!< D3D device status is D3DERR_DEVICELOST or D3DERR_DEVICENOTRESET - the user has to reset the device."]
pub const _NvAPI_Status_NVAPI_D3D_DEVICE_LOST: _NvAPI_Status = -179;
#[doc = "!< The requested action cannot be performed in the current state."]
pub const _NvAPI_Status_NVAPI_INVALID_CONFIGURATION: _NvAPI_Status = -180;
#[doc = "!< Call failed as stereo handshake not completed."]
pub const _NvAPI_Status_NVAPI_STEREO_HANDSHAKE_NOT_DONE: _NvAPI_Status = -181;
#[doc = "!< The path provided was too short to determine the correct NVDRS_APPLICATION"]
pub const _NvAPI_Status_NVAPI_EXECUTABLE_PATH_IS_AMBIGUOUS: _NvAPI_Status = -182;
#[doc = "!< Default stereo profile is not currently defined"]
pub const _NvAPI_Status_NVAPI_DEFAULT_STEREO_PROFILE_IS_NOT_DEFINED: _NvAPI_Status = -183;
#[doc = "!< Default stereo profile does not exist"]
pub const _NvAPI_Status_NVAPI_DEFAULT_STEREO_PROFILE_DOES_NOT_EXIST: _NvAPI_Status = -184;
#[doc = "!< A cluster is already defined with the given configuration."]
pub const _NvAPI_Status_NVAPI_CLUSTER_ALREADY_EXISTS: _NvAPI_Status = -185;
#[doc = "!< The input display id is not that of a multi stream enabled connector or a display device in a multi stream topology"]
pub const _NvAPI_Status_NVAPI_DPMST_DISPLAY_ID_EXPECTED: _NvAPI_Status = -186;
#[doc = "!< The input display id is not valid or the monitor associated to it does not support the current operation"]
pub const _NvAPI_Status_NVAPI_INVALID_DISPLAY_ID: _NvAPI_Status = -187;
#[doc = "!< While playing secure audio stream, stream goes out of sync"]
pub const _NvAPI_Status_NVAPI_STREAM_IS_OUT_OF_SYNC: _NvAPI_Status = -188;
#[doc = "!< Older audio driver version than required"]
pub const _NvAPI_Status_NVAPI_INCOMPATIBLE_AUDIO_DRIVER: _NvAPI_Status = -189;
#[doc = "!< Value already set, setting again not allowed."]
pub const _NvAPI_Status_NVAPI_VALUE_ALREADY_SET: _NvAPI_Status = -190;
#[doc = "!< Requested operation timed out"]
pub const _NvAPI_Status_NVAPI_TIMEOUT: _NvAPI_Status = -191;
#[doc = "!< The requested workstation feature set has incomplete driver internal allocation resources"]
pub const _NvAPI_Status_NVAPI_GPU_WORKSTATION_FEATURE_INCOMPLETE: _NvAPI_Status = -192;
#[doc = "!< Call failed because InitActivation was not called."]
pub const _NvAPI_Status_NVAPI_STEREO_INIT_ACTIVATION_NOT_DONE: _NvAPI_Status = -193;
#[doc = "!< The requested action cannot be performed without Sync being enabled."]
pub const _NvAPI_Status_NVAPI_SYNC_NOT_ACTIVE: _NvAPI_Status = -194;
#[doc = "!< The requested action cannot be performed without Sync Master being enabled."]
pub const _NvAPI_Status_NVAPI_SYNC_MASTER_NOT_FOUND: _NvAPI_Status = -195;
#[doc = "!< Invalid displays passed in the NV_GSYNC_DISPLAY pointer."]
pub const _NvAPI_Status_NVAPI_INVALID_SYNC_TOPOLOGY: _NvAPI_Status = -196;
#[doc = "!< The specified signing algorithm is not supported. Either an incorrect value was entered or the current installed driver/hardware does not support the input value."]
pub const _NvAPI_Status_NVAPI_ECID_SIGN_ALGO_UNSUPPORTED: _NvAPI_Status = -197;
#[doc = "!< The encrypted public key verification has failed."]
pub const _NvAPI_Status_NVAPI_ECID_KEY_VERIFICATION_FAILED: _NvAPI_Status = -198;
#[doc = "!< The device's firmware is out of date."]
pub const _NvAPI_Status_NVAPI_FIRMWARE_OUT_OF_DATE: _NvAPI_Status = -199;
#[doc = "!< The device's firmware is not supported."]
pub const _NvAPI_Status_NVAPI_FIRMWARE_REVISION_NOT_SUPPORTED: _NvAPI_Status = -200;
#[doc = "!< The caller is not authorized to modify the License."]
pub const _NvAPI_Status_NVAPI_LICENSE_CALLER_AUTHENTICATION_FAILED: _NvAPI_Status = -201;
#[doc = "!< The user tried to use a deferred context without registering the device first"]
pub const _NvAPI_Status_NVAPI_D3D_DEVICE_NOT_REGISTERED: _NvAPI_Status = -202;
#[doc = "!< Head or SourceId was not reserved for the VR Display before doing the Modeset or the dedicated display."]
pub const _NvAPI_Status_NVAPI_RESOURCE_NOT_ACQUIRED: _NvAPI_Status = -203;
#[doc = "!< Provided timing is not supported."]
pub const _NvAPI_Status_NVAPI_TIMING_NOT_SUPPORTED: _NvAPI_Status = -204;
#[doc = "!< HDCP Encryption Failed for the device. Would be applicable when the device is HDCP Capable."]
pub const _NvAPI_Status_NVAPI_HDCP_ENCRYPTION_FAILED: _NvAPI_Status = -205;
#[doc = "!< Provided mode is over sink device pclk limitation."]
pub const _NvAPI_Status_NVAPI_PCLK_LIMITATION_FAILED: _NvAPI_Status = -206;
#[doc = "!< No connector on GPU found."]
pub const _NvAPI_Status_NVAPI_NO_CONNECTOR_FOUND: _NvAPI_Status = -207;
#[doc = "!< When a non-HDCP capable HMD is connected, we would inform user by this code."]
pub const _NvAPI_Status_NVAPI_HDCP_DISABLED: _NvAPI_Status = -208;
#[doc = "!< Atleast an API is still being called"]
pub const _NvAPI_Status_NVAPI_API_IN_USE: _NvAPI_Status = -209;
#[doc = "!< No display found on Nvidia GPU(s)."]
pub const _NvAPI_Status_NVAPI_NVIDIA_DISPLAY_NOT_FOUND: _NvAPI_Status = -210;
#[doc = "!< Priv security violation, improper access to a secured register."]
pub const _NvAPI_Status_NVAPI_PRIV_SEC_VIOLATION: _NvAPI_Status = -211;
#[doc = "!< NVAPI cannot be called by this vendor"]
pub const _NvAPI_Status_NVAPI_INCORRECT_VENDOR: _NvAPI_Status = -212;
#[doc = "!< DirectMode Display is already in use"]
pub const _NvAPI_Status_NVAPI_DISPLAY_IN_USE: _NvAPI_Status = -213;
#[doc = "!< The Config is having Non-NVidia GPU with Non-HDCP HMD connected"]
pub const _NvAPI_Status_NVAPI_UNSUPPORTED_CONFIG_NON_HDCP_HMD: _NvAPI_Status = -214;
#[doc = "!< GPU's Max Display Limit has Reached"]
pub const _NvAPI_Status_NVAPI_MAX_DISPLAY_LIMIT_REACHED: _NvAPI_Status = -215;
#[doc = "!< DirectMode not Enabled on the Display"]
pub const _NvAPI_Status_NVAPI_INVALID_DIRECT_MODE_DISPLAY: _NvAPI_Status = -216;
#[doc = "!< GPU is in debug mode, OC is NOT allowed."]
pub const _NvAPI_Status_NVAPI_GPU_IN_DEBUG_MODE: _NvAPI_Status = -217;
#[doc = "!< No NvAPI context was found for this D3D object"]
pub const _NvAPI_Status_NVAPI_D3D_CONTEXT_NOT_FOUND: _NvAPI_Status = -218;
#[doc = "!< there is version mismatch between stereo driver and dx driver"]
pub const _NvAPI_Status_NVAPI_STEREO_VERSION_MISMATCH: _NvAPI_Status = -219;
#[doc = "!< GPU is not powered and so the request cannot be completed."]
pub const _NvAPI_Status_NVAPI_GPU_NOT_POWERED: _NvAPI_Status = -220;
#[doc = "!< The display driver update in progress."]
pub const _NvAPI_Status_NVAPI_ERROR_DRIVER_RELOAD_IN_PROGRESS: _NvAPI_Status = -221;
#[doc = "!< Wait for HW resources allocation"]
pub const _NvAPI_Status_NVAPI_WAIT_FOR_HW_RESOURCE: _NvAPI_Status = -222;
#[doc = "!< operation requires further HDCP action"]
pub const _NvAPI_Status_NVAPI_REQUIRE_FURTHER_HDCP_ACTION: _NvAPI_Status = -223;
#[doc = "!< Dynamic Mux transition failure"]
pub const _NvAPI_Status_NVAPI_DISPLAY_MUX_TRANSITION_FAILED: _NvAPI_Status = -224;
#[doc = "!< Invalid DSC version"]
pub const _NvAPI_Status_NVAPI_INVALID_DSC_VERSION: _NvAPI_Status = -225;
#[doc = "!< Invalid DSC slice count"]
pub const _NvAPI_Status_NVAPI_INVALID_DSC_SLICECOUNT: _NvAPI_Status = -226;
#[doc = "!< Invalid DSC output BPP"]
pub const _NvAPI_Status_NVAPI_INVALID_DSC_OUTPUT_BPP: _NvAPI_Status = -227;
#[doc = "!< There was an error while loading nvapi.dll from the driver store."]
pub const _NvAPI_Status_NVAPI_FAILED_TO_LOAD_FROM_DRIVER_STORE: _NvAPI_Status = -228;
#[doc = "!< OpenGL does not export Vulkan fake extensions"]
pub const _NvAPI_Status_NVAPI_NO_VULKAN: _NvAPI_Status = -229;
#[doc = "!< A request for NvTOPPs telemetry CData has already been made and is pending a response."]
pub const _NvAPI_Status_NVAPI_REQUEST_PENDING: _NvAPI_Status = -230;
#[doc = "!< Operation cannot be performed because the resource is in use."]
pub const _NvAPI_Status_NVAPI_RESOURCE_IN_USE: _NvAPI_Status = -231;
#[doc = "!< Device kernel image is invalid"]
pub const _NvAPI_Status_NVAPI_INVALID_IMAGE: _NvAPI_Status = -232;
#[doc = "!< PTX JIT compilation failed"]
pub const _NvAPI_Status_NVAPI_INVALID_PTX: _NvAPI_Status = -233;
#[doc = "!< Uncorrectable NVLink error was detected during the execution"]
pub const _NvAPI_Status_NVAPI_NVLINK_UNCORRECTABLE: _NvAPI_Status = -234;
#[doc = "!< PTX JIT compiler library was not found."]
pub const _NvAPI_Status_NVAPI_JIT_COMPILER_NOT_FOUND: _NvAPI_Status = -235;
#[doc = "!< Device kernel source is invalid."]
pub const _NvAPI_Status_NVAPI_INVALID_SOURCE: _NvAPI_Status = -236;
#[doc = "!< While executing a kernel, the device encountered an illegal instruction."]
pub const _NvAPI_Status_NVAPI_ILLEGAL_INSTRUCTION: _NvAPI_Status = -237;
#[doc = "!< While executing a kernel, the device program counter wrapped its address space"]
pub const _NvAPI_Status_NVAPI_INVALID_PC: _NvAPI_Status = -238;
#[doc = "!< An exception occurred on the device while executing a kernel"]
pub const _NvAPI_Status_NVAPI_LAUNCH_FAILED: _NvAPI_Status = -239;
#[doc = "!< Attempted operation is not permitted."]
pub const _NvAPI_Status_NVAPI_NOT_PERMITTED: _NvAPI_Status = -240;
#[doc = "!< The callback function has already been registered."]
pub const _NvAPI_Status_NVAPI_CALLBACK_ALREADY_REGISTERED: _NvAPI_Status = -241;
#[doc = "!< The callback function is not found or not registered."]
pub const _NvAPI_Status_NVAPI_CALLBACK_NOT_FOUND: _NvAPI_Status = -242;
#[doc = "! NvAPI Status Values\n!   All NvAPI functions return one of these codes.\n!   \\ingroup nvapistatus"]
pub type _NvAPI_Status = ::std::os::raw::c_int;
#[doc = "! NvAPI Status Values\n!   All NvAPI functions return one of these codes.\n!   \\ingroup nvapistatus"]
pub use self::_NvAPI_Status as NvAPI_Status;
extern "C" {
    #[doc = "!   DESCRIPTION: This API returns display driver version and driver-branch string.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\param [out]  pDriverVersion         Contains the driver version after successful return.\n! \\param [out]  szBuildBranchString    Contains the driver-branch string after successful return.\n!\n! \\retval ::NVAPI_INVALID_ARGUMENT: either pDriverVersion is NULL or enum index too big\n! \\retval ::NVAPI_OK - completed request\n! \\retval ::NVAPI_API_NOT_INTIALIZED - NVAPI not initialized\n! \\retval ::NVAPI_ERROR - miscellaneous error occurred\n!\n! \\ingroup driverapi\n"]
    pub fn NvAPI_SYS_GetDriverAndBranchVersion(
        pDriverVersion: *mut NvU32,
        szBuildBranchString: *mut ::std::os::raw::c_char,
    ) -> NvAPI_Status;
}
#[doc = "! \\ingroup driverapi\n! Used in NvAPI_GPU_GetMemoryInfo()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_DISPLAY_DRIVER_MEMORY_INFO_V1 {
    #[doc = "!< Version info"]
    pub version: NvU32,
    #[doc = "!< Size(in kb) of the physical framebuffer."]
    pub dedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of the available physical framebuffer for allocating video memory surfaces."]
    pub availableDedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of system memory the driver allocates at load time."]
    pub systemVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of shared system memory that driver is allowed to commit for surfaces across all allocations."]
    pub sharedSystemMemory: NvU32,
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_DRIVER_MEMORY_INFO_V1() {
    const UNINIT: ::std::mem::MaybeUninit<NV_DISPLAY_DRIVER_MEMORY_INFO_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_DRIVER_MEMORY_INFO_V1>(),
        20usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_DRIVER_MEMORY_INFO_V1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dedicatedVideoMemory) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1),
            "::",
            stringify!(dedicatedVideoMemory)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).availableDedicatedVideoMemory) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1),
            "::",
            stringify!(availableDedicatedVideoMemory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).systemVideoMemory) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1),
            "::",
            stringify!(systemVideoMemory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sharedSystemMemory) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1),
            "::",
            stringify!(sharedSystemMemory)
        )
    );
}
#[doc = "! \\ingroup driverapi\n! Used in NvAPI_GPU_GetMemoryInfo()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_DISPLAY_DRIVER_MEMORY_INFO_V2 {
    #[doc = "!< Version info"]
    pub version: NvU32,
    #[doc = "!< Size(in kb) of the physical framebuffer."]
    pub dedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of the available physical framebuffer for allocating video memory surfaces."]
    pub availableDedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of system memory the driver allocates at load time."]
    pub systemVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of shared system memory that driver is allowed to commit for surfaces across all allocations."]
    pub sharedSystemMemory: NvU32,
    #[doc = "!< Size(in kb) of the current available physical framebuffer for allocating video memory surfaces."]
    pub curAvailableDedicatedVideoMemory: NvU32,
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_DRIVER_MEMORY_INFO_V2() {
    const UNINIT: ::std::mem::MaybeUninit<NV_DISPLAY_DRIVER_MEMORY_INFO_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_DRIVER_MEMORY_INFO_V2>(),
        24usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_DRIVER_MEMORY_INFO_V2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dedicatedVideoMemory) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2),
            "::",
            stringify!(dedicatedVideoMemory)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).availableDedicatedVideoMemory) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2),
            "::",
            stringify!(availableDedicatedVideoMemory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).systemVideoMemory) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2),
            "::",
            stringify!(systemVideoMemory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sharedSystemMemory) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2),
            "::",
            stringify!(sharedSystemMemory)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).curAvailableDedicatedVideoMemory) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2),
            "::",
            stringify!(curAvailableDedicatedVideoMemory)
        )
    );
}
#[doc = "! \\ingroup driverapi\n! Used in NvAPI_GPU_GetMemoryInfo()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_DISPLAY_DRIVER_MEMORY_INFO_V3 {
    #[doc = "!< Version info"]
    pub version: NvU32,
    #[doc = "!< Size(in kb) of the physical framebuffer."]
    pub dedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of the available physical framebuffer for allocating video memory surfaces."]
    pub availableDedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of system memory the driver allocates at load time."]
    pub systemVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of shared system memory that driver is allowed to commit for surfaces across all allocations."]
    pub sharedSystemMemory: NvU32,
    #[doc = "!< Size(in kb) of the current available physical framebuffer for allocating video memory surfaces."]
    pub curAvailableDedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of the total size of memory released as a result of the evictions."]
    pub dedicatedVideoMemoryEvictionsSize: NvU32,
    #[doc = "!< Indicates the number of eviction events that caused an allocation to be removed from dedicated video memory to free GPU\n!< video memory to make room for other allocations."]
    pub dedicatedVideoMemoryEvictionCount: NvU32,
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_DRIVER_MEMORY_INFO_V3() {
    const UNINIT: ::std::mem::MaybeUninit<NV_DISPLAY_DRIVER_MEMORY_INFO_V3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_DRIVER_MEMORY_INFO_V3>(),
        32usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_DRIVER_MEMORY_INFO_V3>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dedicatedVideoMemory) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
            "::",
            stringify!(dedicatedVideoMemory)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).availableDedicatedVideoMemory) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
            "::",
            stringify!(availableDedicatedVideoMemory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).systemVideoMemory) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
            "::",
            stringify!(systemVideoMemory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sharedSystemMemory) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
            "::",
            stringify!(sharedSystemMemory)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).curAvailableDedicatedVideoMemory) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
            "::",
            stringify!(curAvailableDedicatedVideoMemory)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).dedicatedVideoMemoryEvictionsSize) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
            "::",
            stringify!(dedicatedVideoMemoryEvictionsSize)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).dedicatedVideoMemoryEvictionCount) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
            "::",
            stringify!(dedicatedVideoMemoryEvictionCount)
        )
    );
}
#[doc = "! \\ingroup driverapi"]
pub type NV_DISPLAY_DRIVER_MEMORY_INFO = NV_DISPLAY_DRIVER_MEMORY_INFO_V3;
extern "C" {
    #[doc = "!   DESCRIPTION: This function retrieves the available driver memory footprint for the specified GPU.\n!                If the GPU is in TCC Mode, only dedicatedVideoMemory will be returned in pMemoryInfo (NV_DISPLAY_DRIVER_MEMORY_INFO).\n!\n! \\deprecated  Do not use this function - it is deprecated in release 520. Instead, use NvAPI_GPU_GetMemoryInfoEx.\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 177\n!\n!  \\param [in]   hPhysicalGpu  Handle of the physical GPU for which the memory information is to be extracted.\n!  \\param [out]  pMemoryInfo   The memory footprint available in the driver. See NV_DISPLAY_DRIVER_MEMORY_INFO.\n!\n!  \\retval       NVAPI_INVALID_ARGUMENT             pMemoryInfo is NULL.\n!  \\retval       NVAPI_OK                           Call successful.\n!  \\retval       NVAPI_NVIDIA_DEVICE_NOT_FOUND      No NVIDIA GPU driving a display was found.\n!  \\retval       NVAPI_INCOMPATIBLE_STRUCT_VERSION  NV_DISPLAY_DRIVER_MEMORY_INFO structure version mismatch.\n!\n!  \\ingroup  driverapi\n"]
    pub fn NvAPI_GPU_GetMemoryInfo(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pMemoryInfo: *mut NV_DISPLAY_DRIVER_MEMORY_INFO,
    ) -> NvAPI_Status;
}
#[doc = "! \\ingroup driverapi\n! Used in NvAPI_GPU_GetMemoryInfoEx()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_GPU_MEMORY_INFO_EX_V1 {
    #[doc = "!< Structure version"]
    pub version: NvU32,
    #[doc = "!< Size(in bytes) of the physical framebuffer."]
    pub dedicatedVideoMemory: NvU64,
    #[doc = "!< Size(in bytes) of the available physical framebuffer for allocating video memory surfaces."]
    pub availableDedicatedVideoMemory: NvU64,
    #[doc = "!< Size(in bytes) of system memory the driver allocates at load time."]
    pub systemVideoMemory: NvU64,
    #[doc = "!< Size(in bytes) of shared system memory that driver is allowed to commit for surfaces across all allocations."]
    pub sharedSystemMemory: NvU64,
    #[doc = "!< Size(in bytes) of the current available physical framebuffer for allocating video memory surfaces."]
    pub curAvailableDedicatedVideoMemory: NvU64,
    #[doc = "!< Size(in bytes) of the total size of memory released as a result of the evictions."]
    pub dedicatedVideoMemoryEvictionsSize: NvU64,
    #[doc = "!< Indicates the number of eviction events that caused an allocation to be removed from dedicated video memory to free GPU\n!< video memory to make room for other allocations."]
    pub dedicatedVideoMemoryEvictionCount: NvU64,
    #[doc = "!< Size(in bytes) of the total size of memory allocated as a result of the promotions."]
    pub dedicatedVideoMemoryPromotionsSize: NvU64,
    #[doc = "!< Indicates the number of promotion events that caused an allocation to be promoted to dedicated video memory"]
    pub dedicatedVideoMemoryPromotionCount: NvU64,
}
#[test]
fn bindgen_test_layout_NV_GPU_MEMORY_INFO_EX_V1() {
    const UNINIT: ::std::mem::MaybeUninit<NV_GPU_MEMORY_INFO_EX_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_MEMORY_INFO_EX_V1>(),
        80usize,
        concat!("Size of: ", stringify!(NV_GPU_MEMORY_INFO_EX_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_MEMORY_INFO_EX_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(NV_GPU_MEMORY_INFO_EX_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_MEMORY_INFO_EX_V1),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dedicatedVideoMemory) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_MEMORY_INFO_EX_V1),
            "::",
            stringify!(dedicatedVideoMemory)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).availableDedicatedVideoMemory) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_MEMORY_INFO_EX_V1),
            "::",
            stringify!(availableDedicatedVideoMemory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).systemVideoMemory) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_MEMORY_INFO_EX_V1),
            "::",
            stringify!(systemVideoMemory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sharedSystemMemory) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_MEMORY_INFO_EX_V1),
            "::",
            stringify!(sharedSystemMemory)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).curAvailableDedicatedVideoMemory) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_MEMORY_INFO_EX_V1),
            "::",
            stringify!(curAvailableDedicatedVideoMemory)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).dedicatedVideoMemoryEvictionsSize) as usize - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_MEMORY_INFO_EX_V1),
            "::",
            stringify!(dedicatedVideoMemoryEvictionsSize)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).dedicatedVideoMemoryEvictionCount) as usize - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_MEMORY_INFO_EX_V1),
            "::",
            stringify!(dedicatedVideoMemoryEvictionCount)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).dedicatedVideoMemoryPromotionsSize) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_MEMORY_INFO_EX_V1),
            "::",
            stringify!(dedicatedVideoMemoryPromotionsSize)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).dedicatedVideoMemoryPromotionCount) as usize - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_MEMORY_INFO_EX_V1),
            "::",
            stringify!(dedicatedVideoMemoryPromotionCount)
        )
    );
}
#[doc = "! \\ingroup driverapi"]
pub type NV_GPU_MEMORY_INFO_EX = NV_GPU_MEMORY_INFO_EX_V1;
extern "C" {
    #[doc = "!   DESCRIPTION: This function retrieves the available driver memory footprint for the specified GPU.\n!                If the GPU is in TCC Mode, only dedicatedVideoMemory will be returned in pMemoryInfo (NV_GPU_MEMORY_INFO_EX).\n!\n! SUPPORTED OS:  Windows 10 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 520\n!\n!  \\param [in]   hPhysicalGpu  Handle of the physical GPU for which the memory information is to be extracted.\n!  \\param [out]  pMemoryInfo   The memory footprint available in the driver. See NV_GPU_MEMORY_INFO_EX.\n!\n!  \\retval       NVAPI_INVALID_ARGUMENT             pMemoryInfo is NULL.\n!  \\retval       NVAPI_OK                           Call successful.\n!  \\retval       NVAPI_NVIDIA_DEVICE_NOT_FOUND      No NVIDIA GPU driving a display was found.\n!  \\retval       NVAPI_INCOMPATIBLE_STRUCT_VERSION  NV_GPU_MEMORY_INFO_EX structure version mismatch.\n!\n!  \\ingroup  driverapi\n"]
    pub fn NvAPI_GPU_GetMemoryInfoEx(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pMemoryInfo: *mut NV_GPU_MEMORY_INFO_EX,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns an array of physical GPU handles.\n! Each handle represents a physical GPU present in the system.\n! That GPU may be part of an SLI configuration, or may not be visible to the OS directly.\n!\n! At least one GPU must be present in the system and running an NVIDIA display driver.\n!\n! The array nvGPUHandle will be filled with physical GPU handle values. The returned\n! gpuCount determines how many entries in the array are valid.\n!\n! \\note In drivers older than 105.00, all physical GPU handles get invalidated on a\n!       modeset. So the calling applications need to renum the handles after every modeset.\\n\n!       With drivers 105.00 and up, all physical GPU handles are constant.\n!       Physical GPU handles are constant as long as the GPUs are not physically moved and\n!       the SBIOS VGA order is unchanged.\n!\n!       For GPU handles in TCC MODE please use NvAPI_EnumTCCPhysicalGPUs()\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\par Introduced in\n! \\since Release: 80\n!\n! \\retval NVAPI_INVALID_ARGUMENT         nvGPUHandle or pGpuCount is NULL\n! \\retval NVAPI_OK                       One or more handles were returned\n! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  No NVIDIA GPU driving a display was found\n! \\ingroup gpu\n"]
    pub fn NvAPI_EnumPhysicalGPUs(
        nvGPUHandle: *mut NvPhysicalGpuHandle,
        pGpuCount: *mut NvU32,
    ) -> NvAPI_Status;
}
#[doc = "! \\ingroup dx\n! Used in NvAPI_D3D10_GetCurrentSLIState(), and NvAPI_D3D_GetCurrentSLIState()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_GET_CURRENT_SLI_STATE_V1 {
    #[doc = "!< Structure version"]
    pub version: NvU32,
    #[doc = "!< [OUT] The maximum possible value of numAFRGroups"]
    pub maxNumAFRGroups: NvU32,
    #[doc = "!< [OUT] The number of AFR groups enabled in the system"]
    pub numAFRGroups: NvU32,
    #[doc = "!< [OUT] The AFR group index for the frame currently being rendered"]
    pub currentAFRIndex: NvU32,
    #[doc = "!< [OUT] What the AFR group index will be for the next frame (i.e. after calling Present)"]
    pub nextFrameAFRIndex: NvU32,
    #[doc = "!< [OUT] The AFR group index that was used for the previous frame (~0 if more than one frame has not been rendered yet)"]
    pub previousFrameAFRIndex: NvU32,
    #[doc = "!< [OUT] Boolean: Is this frame the first time running on the current AFR group"]
    pub bIsCurAFRGroupNew: NvU32,
}
#[test]
fn bindgen_test_layout_NV_GET_CURRENT_SLI_STATE_V1() {
    const UNINIT: ::std::mem::MaybeUninit<NV_GET_CURRENT_SLI_STATE_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GET_CURRENT_SLI_STATE_V1>(),
        28usize,
        concat!("Size of: ", stringify!(NV_GET_CURRENT_SLI_STATE_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GET_CURRENT_SLI_STATE_V1>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_GET_CURRENT_SLI_STATE_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V1),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxNumAFRGroups) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V1),
            "::",
            stringify!(maxNumAFRGroups)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numAFRGroups) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V1),
            "::",
            stringify!(numAFRGroups)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).currentAFRIndex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V1),
            "::",
            stringify!(currentAFRIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nextFrameAFRIndex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V1),
            "::",
            stringify!(nextFrameAFRIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).previousFrameAFRIndex) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V1),
            "::",
            stringify!(previousFrameAFRIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bIsCurAFRGroupNew) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V1),
            "::",
            stringify!(bIsCurAFRGroupNew)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_GET_CURRENT_SLI_STATE_V2 {
    #[doc = "!< Structure version"]
    pub version: NvU32,
    #[doc = "!< [OUT] The maximum possible value of numAFRGroups"]
    pub maxNumAFRGroups: NvU32,
    #[doc = "!< [OUT] The number of AFR groups enabled in the system"]
    pub numAFRGroups: NvU32,
    #[doc = "!< [OUT] The AFR group index for the frame currently being rendered"]
    pub currentAFRIndex: NvU32,
    #[doc = "!< [OUT] What the AFR group index will be for the next frame (i.e. after calling Present)"]
    pub nextFrameAFRIndex: NvU32,
    #[doc = "!< [OUT] The AFR group index that was used for the previous frame (~0 if more than one frame has not been rendered yet)"]
    pub previousFrameAFRIndex: NvU32,
    #[doc = "!< [OUT] Boolean: Is this frame the first time running on the current AFR group"]
    pub bIsCurAFRGroupNew: NvU32,
    #[doc = "!< [OUT] The number of GPUs used in VR-SLI. If it is 0 VR-SLI is not active"]
    pub numVRSLIGpus: NvU32,
}
#[test]
fn bindgen_test_layout_NV_GET_CURRENT_SLI_STATE_V2() {
    const UNINIT: ::std::mem::MaybeUninit<NV_GET_CURRENT_SLI_STATE_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GET_CURRENT_SLI_STATE_V2>(),
        32usize,
        concat!("Size of: ", stringify!(NV_GET_CURRENT_SLI_STATE_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GET_CURRENT_SLI_STATE_V2>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_GET_CURRENT_SLI_STATE_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V2),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxNumAFRGroups) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V2),
            "::",
            stringify!(maxNumAFRGroups)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numAFRGroups) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V2),
            "::",
            stringify!(numAFRGroups)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).currentAFRIndex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V2),
            "::",
            stringify!(currentAFRIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nextFrameAFRIndex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V2),
            "::",
            stringify!(nextFrameAFRIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).previousFrameAFRIndex) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V2),
            "::",
            stringify!(previousFrameAFRIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bIsCurAFRGroupNew) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V2),
            "::",
            stringify!(bIsCurAFRGroupNew)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numVRSLIGpus) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GET_CURRENT_SLI_STATE_V2),
            "::",
            stringify!(numVRSLIGpus)
        )
    );
}
extern "C" {
    #[doc = "! DESCRIPTION:     This API returns the Display ID of the GDI Primary.\n!\n! \\param [out]     displayId   Display ID of the GDI Primary display.\n!\n! \\retval ::NVAPI_OK:                          Capabilties have been returned.\n! \\retval ::NVAPI_NVIDIA_DEVICE_NOT_FOUND:     GDI Primary not on an NVIDIA GPU.\n! \\retval ::NVAPI_INVALID_ARGUMENT:            One or more args passed in are invalid.\n! \\retval ::NVAPI_API_NOT_INTIALIZED:          The NvAPI API needs to be initialized first\n! \\retval ::NVAPI_NO_IMPLEMENTATION:           This entrypoint not available\n! \\retval ::NVAPI_ERROR:                       Miscellaneous error occurred\n!\n! \\ingroup dispcontrol\n"]
    pub fn NvAPI_DISP_GetGDIPrimaryDisplayId(displayId: *mut NvU32) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:     This API returns the viewports that would be applied on\n!                  the requested display.\n!\n! \\param [in]      displayId       Display ID of a single display in the active\n!                                  mosaic topology to query.\n! \\param [in]      srcWidth        Width of full display topology. If both\n!                                  width and height are 0, the current\n!                                  resolution is used.\n! \\param [in]      srcHeight       Height of full display topology. If both\n!                                  width and height are 0, the current\n!                                  resolution is used.\n! \\param [out]     viewports       Array of NV_RECT viewports which represent\n!                                  the displays as identified in\n!                                  NvAPI_Mosaic_EnumGridTopologies. If the\n!                                  requested resolution is a single-wide\n!                                  resolution, only viewports[0] will\n!                                  contain the viewport details, regardless\n!                                  of which display is driving the display.\n! \\param [out]     bezelCorrected  Returns 1 if the requested resolution is\n!                                  bezel corrected. May be NULL.\n!\n! \\retval ::NVAPI_OK                          Capabilties have been returned.\n! \\retval ::NVAPI_INVALID_ARGUMENT            One or more args passed in are invalid.\n! \\retval ::NVAPI_API_NOT_INTIALIZED          The NvAPI API needs to be initialized first\n! \\retval ::NVAPI_MOSAIC_NOT_ACTIVE           The display does not belong to an active Mosaic Topology\n! \\retval ::NVAPI_NO_IMPLEMENTATION           This entrypoint not available\n! \\retval ::NVAPI_ERROR                       Miscellaneous error occurred\n!\n! \\ingroup mosaicapi\n"]
    pub fn NvAPI_Mosaic_GetDisplayViewportsByResolution(
        displayId: NvU32,
        srcWidth: NvU32,
        srcHeight: NvU32,
        viewports: *mut NV_RECT,
        bezelCorrected: *mut NvU8,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This APU enables stereo mode in the registry.\n!                Calls to this function affect the entire system.\n!                If stereo is not enabled, then calls to functions that require that stereo is enabled have no effect,\n!                and will return the appropriate error code.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 180\n!\n! \\retval ::NVAPI_OK                      Stereo is now enabled.\n! \\retval ::NVAPI_API_NOT_INTIALIZED\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED  Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_ERROR\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_Enable() -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API disables stereo mode in the registry.\n!                Calls to this function affect the entire system.\n!                If stereo is not enabled, then calls to functions that require that stereo is enabled have no effect,\n!                and will return the appropriate error code.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 180\n!\n! \\retval ::NVAPI_OK                     Stereo is now disabled.\n! \\retval ::NVAPI_API_NOT_INTIALIZED\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_ERROR\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_Disable() -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API checks if stereo mode is enabled in the registry.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 180\n!\n! \\param [out]     pIsStereoEnabled   Address where the result of the inquiry will be placed.\n!\n! \\retval ::NVAPI_OK                       Check was sucessfully completed and result reflects current state of stereo availability.\n! \\retval ::NVAPI_API_NOT_INTIALIZED\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED   Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_ERROR\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_IsEnabled(pIsStereoEnabled: *mut NvU8) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API destroys the stereo handle created with one of the NvAPI_Stereo_CreateHandleFrom() functions.\n!                This should be called after the device corresponding to the handle has been destroyed.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 180\n!\n! \\param [in]     stereoHandle  Stereo handle that is to be destroyed.\n!\n! \\retval ::NVAPI_OK                      Stereo handle is destroyed.\n! \\retval ::NVAPI_API_NOT_INTIALIZED\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED  Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_ERROR\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_DestroyHandle(stereoHandle: StereoHandle) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API activates stereo for the device interface corresponding to the given stereo handle.\n!                Activating stereo is possible only if stereo was enabled previously in the registry.\n!                If stereo is not activated, then calls to functions that require that stereo is activated have no effect,\n!                and will return the appropriate error code.\n!\n! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to the appropriate NvAPI_Stereo_CreateHandleFrom() function.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 180\n!\n! \\param [in]    stereoHandle  Stereo handle corresponding to the device interface.\n!\n! \\retval ::NVAPI_OK                                Stereo is turned on.\n! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE   Device interface is not valid. Create again, then attach again.\n! \\retval ::NVAPI_API_NOT_INTIALIZED\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED            Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_ERROR\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_Activate(stereoHandle: StereoHandle) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API deactivates stereo for the given device interface.\n!                If stereo is not activated, then calls to functions that require that stereo is activated have no effect,\n!                and will return the appropriate error code.\n!\n! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to the appropriate NvAPI_Stereo_CreateHandleFrom() function.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 180\n!\n! \\param [in]     stereoHandle  Stereo handle that corresponds to the device interface.\n!\n! \\retval ::NVAPI_OK                               Stereo is turned off.\n! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE  Device interface is not valid. Create again, then attach again.\n! \\retval ::NVAPI_API_NOT_INTIALIZED\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED           Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_ERROR\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_Deactivate(stereoHandle: StereoHandle) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API checks if stereo is activated for the given device interface.\n!\n! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to the appropriate NvAPI_Stereo_CreateHandleFrom() function.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 180\n!\n! \\param [in]    stereoHandle  Stereo handle that corresponds to the device interface.\n! \\param [in]    pIsStereoOn   Address where result of the inquiry will be placed.\n!\n! \\retval ::NVAPI_OK - Check was sucessfully completed and result reflects current state of stereo (on/off).\n! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE - Device interface is not valid. Create again, then attach again.\n! \\retval ::NVAPI_API_NOT_INTIALIZED - NVAPI not initialized.\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED - Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_ERROR - Something is wrong (generic error).\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_IsActivated(
        stereoHandle: StereoHandle,
        pIsStereoOn: *mut NvU8,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API gets current separation value (in percents).\n!\n! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to the appropriate NvAPI_Stereo_CreateHandleFrom() function.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 180\n!\n! \\param [in]     stereoHandle           Stereo handle that corresponds to the device interface.\n! \\param [out]    pSeparationPercentage  Address of @c float type variable to store current separation percentage in.\n!\n! \\retval ::NVAPI_OK                                Retrieval of separation percentage was successfull.\n! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE   Device interface is not valid. Create again, then attach again.\n! \\retval ::NVAPI_API_NOT_INTIALIZED\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED            Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_ERROR\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_GetSeparation(
        stereoHandle: StereoHandle,
        pSeparationPercentage: *mut f32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API sets separation to given percentage.\n!\n! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to appropriate NvAPI_Stereo_CreateHandleFrom() function.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 180\n!\n! \\param [in]     stereoHandle             Stereo handle that corresponds to the device interface.\n! \\param [in]     newSeparationPercentage  New value for separation percentage.\n!\n! \\retval ::NVAPI_OK                               Setting of separation percentage was successfull.\n! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE  Device interface is not valid. Create again, then attach again.\n! \\retval ::NVAPI_API_NOT_INTIALIZED               NVAPI not initialized.\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED           Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_STEREO_PARAMETER_OUT_OF_RANGE    Given separation percentage is out of [0..100] range.\n! \\retval ::NVAPI_ERROR\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_SetSeparation(
        stereoHandle: StereoHandle,
        newSeparationPercentage: f32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API gets the current convergence value.\n!\n! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to the appropriate NvAPI_Stereo_CreateHandleFrom() function.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 180\n!\n! \\param [in]     stereoHandle   Stereo handle that corresponds to the device interface.\n! \\param [out]    pConvergence   Address of @c float type variable to store current convergence value in.\n!\n! \\retval ::NVAPI_OK                               Retrieval of convergence value was successfull.\n! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE  Device interface is not valid. Create again, then attach again.\n! \\retval ::NVAPI_API_NOT_INTIALIZED\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED           Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_ERROR\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_GetConvergence(
        stereoHandle: StereoHandle,
        pConvergence: *mut f32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API sets convergence to the given value.\n!\n! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to the appropriate NvAPI_Stereo_CreateHandleFrom() function.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 180\n!\n! \\param [in]     stereoHandle              Stereo handle that corresponds to the device interface.\n! \\param [in]     newConvergence            New value for convergence.\n!\n! \\retval ::NVAPI_OK                                Setting of convergence value was successfull.\n! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE   Device interface is not valid. Create again, then attach again.\n! \\retval ::NVAPI_API_NOT_INTIALIZED\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED            Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_ERROR\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_SetConvergence(
        stereoHandle: StereoHandle,
        newConvergence: f32,
    ) -> NvAPI_Status;
}
pub const _NV_StereoActiveEye_NVAPI_STEREO_EYE_RIGHT: _NV_StereoActiveEye = 1;
pub const _NV_StereoActiveEye_NVAPI_STEREO_EYE_LEFT: _NV_StereoActiveEye = 2;
pub const _NV_StereoActiveEye_NVAPI_STEREO_EYE_MONO: _NV_StereoActiveEye = 3;
#[doc = "! \\ingroup stereoapi"]
pub type _NV_StereoActiveEye = ::std::os::raw::c_int;
#[doc = "! \\ingroup stereoapi"]
pub use self::_NV_StereoActiveEye as NV_STEREO_ACTIVE_EYE;
extern "C" {
    #[doc = "! \\ingroup stereoapi"]
    pub fn NvAPI_Stereo_SetActiveEye(
        hStereoHandle: StereoHandle,
        StereoEye: NV_STEREO_ACTIVE_EYE,
    ) -> NvAPI_Status;
}
pub const _NV_StereoDriverMode_NVAPI_STEREO_DRIVER_MODE_AUTOMATIC: _NV_StereoDriverMode = 0;
pub const _NV_StereoDriverMode_NVAPI_STEREO_DRIVER_MODE_DIRECT: _NV_StereoDriverMode = 2;
#[doc = "! \\ingroup stereoapi"]
pub type _NV_StereoDriverMode = ::std::os::raw::c_int;
#[doc = "! \\ingroup stereoapi"]
pub use self::_NV_StereoDriverMode as NV_STEREO_DRIVER_MODE;
extern "C" {
    #[doc = "! \\ingroup stereoapi"]
    pub fn NvAPI_Stereo_SetDriverMode(mode: NV_STEREO_DRIVER_MODE) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API returns eye separation as a ratio of <between eye distance>/<physical screen width>.\n!\n! HOW TO USE:    After the stereo handle for device interface is created via successfull call to appropriate API. Applies only to DirectX 9 and up.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\param [in]   stereoHandle  Stereo handle that corresponds to the device interface.\n! \\param [out]  pSeparation   Eye separation.\n!\n! \\retval ::NVAPI_OK                               Active eye is set.\n! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE  Device interface is not valid. Create again, then attach again.\n! \\retval ::NVAPI_API_NOT_INTIALIZED               NVAPI not initialized.\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED           Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_ERROR  (generic error).\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_GetEyeSeparation(
        hStereoHandle: StereoHandle,
        pSeparation: *mut f32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API returns availability of windowed mode stereo\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\param [out] bSupported(OUT)    != 0  - supported,  \\n\n!                                 == 0  - is not supported\n!\n!\n! \\retval ::NVAPI_OK                      Retrieval of frustum adjust mode was successfull.\n! \\retval ::NVAPI_API_NOT_INTIALIZED      NVAPI not initialized.\n! \\retval ::NVAPI_STEREO_NOT_INITIALIZED  Stereo part of NVAPI not initialized.\n! \\retval ::NVAPI_ERROR                   Something is wrong (generic error).\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_IsWindowedModeSupported(bSupported: *mut NvU8) -> NvAPI_Status;
}
#[doc = "!< Use driver registry profile settings for surface creation mode."]
pub const _NVAPI_STEREO_SURFACECREATEMODE_NVAPI_STEREO_SURFACECREATEMODE_AUTO:
    _NVAPI_STEREO_SURFACECREATEMODE = 0;
#[doc = "!< Always create stereo surfaces."]
pub const _NVAPI_STEREO_SURFACECREATEMODE_NVAPI_STEREO_SURFACECREATEMODE_FORCESTEREO:
    _NVAPI_STEREO_SURFACECREATEMODE = 1;
#[doc = "!< Always create mono surfaces."]
pub const _NVAPI_STEREO_SURFACECREATEMODE_NVAPI_STEREO_SURFACECREATEMODE_FORCEMONO:
    _NVAPI_STEREO_SURFACECREATEMODE = 2;
#[doc = "! \\ingroup stereoapi"]
pub type _NVAPI_STEREO_SURFACECREATEMODE = ::std::os::raw::c_int;
#[doc = "! \\ingroup stereoapi"]
pub use self::_NVAPI_STEREO_SURFACECREATEMODE as NVAPI_STEREO_SURFACECREATEMODE;
extern "C" {
    #[doc = "! \\ingroup stereoapi"]
    pub fn NvAPI_Stereo_SetSurfaceCreationMode(
        hStereoHandle: StereoHandle,
        creationMode: NVAPI_STEREO_SURFACECREATEMODE,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! \\ingroup stereoapi"]
    pub fn NvAPI_Stereo_GetSurfaceCreationMode(
        hStereoHandle: StereoHandle,
        pCreationMode: *mut NVAPI_STEREO_SURFACECREATEMODE,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! \\param [in]  hStereoHandle    Stereo handle that corresponds to the device interface.\n! \\param [out] pWasStereoized   Address where result of the inquiry will be placed.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! DESCRIPTION: This API checks if the last draw call was stereoized. It is a very expensive to call and should be used for debugging purpose *only*.\n!\n! WHEN TO USE: After the stereo handle for device interface is created via successful call to appropriate NvAPI_Stereo_CreateHandleFrom function.\n!\n! \\return      This API can return any of the error codes enumerated in #NvAPI_Status.\n!              There are no return error codes with specific meaning for this API.\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_Debug_WasLastDrawStereoized(
        hStereoHandle: StereoHandle,
        pWasStereoized: *mut NvU8,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! DESCRIPTION: This API defines the stereo profile used by the driver in case the application has no associated profile.\n!\n! WHEN TO USE: To take effect, this API must be called before D3D device is created. Calling once a device has been created will not affect the current device.\n!\n! \\param [in]  szProfileName        Default profile name.\n!\n! \\return      This API can return any of the error codes enumerated in #NvAPI_Status.\n!              Error codes specific to this API are described below.\n!\n! \\retval      NVAPI_SUCCESS                               - Default stereo profile name has been copied into szProfileName.\n! \\retval      NVAPI_INVALID_ARGUMENT                      - szProfileName == NULL.\n! \\retval      NVAPI_DEFAULT_STEREO_PROFILE_DOES_NOT_EXIST - Default stereo profile does not exist\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_SetDefaultProfile(
        szProfileName: *const ::std::os::raw::c_char,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! DESCRIPTION: This API retrieves the current default stereo profile.\n!\n!              After call cbSizeOut contain 0 if default profile is not set required buffer size cbSizeOut.\n!              To get needed buffer size this function can be called with szProfileName==0 and cbSizeIn == 0.\n!\n! WHEN TO USE: This API can be called at any time.\n!\n!\n! \\param [in]   cbSizeIn             Size of buffer allocated for default stereo profile name.\n! \\param [out]  szProfileName        Default stereo profile name.\n! \\param [out]  pcbSizeOut           Required buffer size.\n!                     # ==0 - there is no default stereo profile name currently set\n!                     # !=0 - size of buffer required for currently set default stereo profile name including trailing '0'.\n!\n!\n! \\return      This API can return any of the error codes enumerated in #NvAPI_Status.\n!              Error codes specific to this API are described below.\n!\n! \\retval      NVAPI_SUCCESS                                - Default stereo profile name has been copied into szProfileName.\n! \\retval      NVAPI_DEFAULT_STEREO_PROFILE_IS_NOT_DEFINED  - There is no default stereo profile set at this time.\n! \\retval      NVAPI_INVALID_ARGUMENT                       - pcbSizeOut == 0 or cbSizeIn >= *pcbSizeOut && szProfileName == 0\n! \\retval      NVAPI_INSUFFICIENT_BUFFER                    - cbSizeIn < *pcbSizeOut\n!\n! \\ingroup stereoapi\n"]
    pub fn NvAPI_Stereo_GetDefaultProfile(
        cbSizeIn: NvU32,
        szProfileName: *mut ::std::os::raw::c_char,
        pcbSizeOut: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function initializes the NvAPI library (if not already initialized) but always increments the ref-counter.\n! This must be called before calling other NvAPI_ functions.\n! Note: It is now mandatory to call NvAPI_Initialize before calling any other NvAPI.\n! NvAPI_Unload should be called to unload the NVAPI Library.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 80\n!\n! \\return      This API can return any of the error codes enumerated in #NvAPI_Status. If there are return error codes with\n!              specific meaning for this API, they are listed below.\n! \\retval      NVAPI_LIBRARY_NOT_FOUND  Failed to load the NVAPI support library\n! \\sa nvapistatus\n! \\ingroup nvapifunctions\n"]
    pub fn NvAPI_Initialize() -> NvAPI_Status;
}
extern "C" {
    #[doc = "!   DESCRIPTION: Decrements the ref-counter and when it reaches ZERO, unloads NVAPI library.\n!                This must be called in pairs with NvAPI_Initialize.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n!        If the client wants unload functionality, it is recommended to always call NvAPI_Initialize and NvAPI_Unload in pairs.\n!\n!  Unloading NvAPI library is not supported when the library is in a resource locked state.\n!  Some functions in the NvAPI library initiates an operation or allocates certain resources\n!  and there are corresponding functions available, to complete the operation or free the\n!  allocated resources. All such function pairs are designed to prevent unloading NvAPI library.\n!\n!  For example, if NvAPI_Unload is called after NvAPI_XXX which locks a resource, it fails with\n!  NVAPI_ERROR. Developers need to call the corresponding NvAPI_YYY to unlock the resources,\n!  before calling NvAPI_Unload again.\n!\n! \\return      This API can return any of the error codes enumerated in #NvAPI_Status. If there are return error codes with\n!              specific meaning for this API, they are listed below.\n! \\retval      NVAPI_API_IN_USE       Atleast an API is still being called hence cannot unload requested driver.\n!\n! \\ingroup nvapifunctions\n"]
    pub fn NvAPI_Unload() -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function converts an NvAPI error code into a null terminated string.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 80\n!\n! \\param nr      The error code to convert\n! \\param szDesc  The string corresponding to the error code\n!\n! \\return NULL terminated string (always, never NULL)\n! \\ingroup nvapifunctions\n"]
    pub fn NvAPI_GetErrorMessage(
        nr: NvAPI_Status,
        szDesc: *mut ::std::os::raw::c_char,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns a string describing the version of the NvAPI library.\n!               The contents of the string are human readable.  Do not assume a fixed\n!                format.\n!\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 80\n!\n! \\param  szDesc User readable string giving NvAPI version information\n!\n! \\return See \\ref nvapistatus for the list of possible return values.\n! \\ingroup nvapifunctions\n"]
    pub fn NvAPI_GetInterfaceVersionString(szDesc: *mut ::std::os::raw::c_char) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns a string describing the version of the NvAPI library.\n!               The contents of the string are human readable.  Do not assume a fixed  format.\n!\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 450\n!\n! \\param  szDesc User readable string giving NvAPI version information\n!\n! \\return See \\ref nvapistatus for the list of possible return values.\n! \\ingroup nvapifunctions\n"]
    pub fn NvAPI_GetInterfaceVersionStringEx(szDesc: *mut ::std::os::raw::c_char) -> NvAPI_Status;
}
pub const _NV_DP_LINK_RATE_NV_DP_1_62GBPS: _NV_DP_LINK_RATE = 6;
pub const _NV_DP_LINK_RATE_NV_DP_2_70GBPS: _NV_DP_LINK_RATE = 10;
pub const _NV_DP_LINK_RATE_NV_DP_5_40GBPS: _NV_DP_LINK_RATE = 20;
pub const _NV_DP_LINK_RATE_NV_DP_8_10GBPS: _NV_DP_LINK_RATE = 30;
pub const _NV_DP_LINK_RATE_NV_EDP_2_16GBPS: _NV_DP_LINK_RATE = 8;
pub const _NV_DP_LINK_RATE_NV_EDP_2_43GBPS: _NV_DP_LINK_RATE = 9;
pub const _NV_DP_LINK_RATE_NV_EDP_3_24GBPS: _NV_DP_LINK_RATE = 12;
pub const _NV_DP_LINK_RATE_NV_EDP_4_32GBPS: _NV_DP_LINK_RATE = 16;
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PORT_INFO."]
pub type _NV_DP_LINK_RATE = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PORT_INFO."]
pub use self::_NV_DP_LINK_RATE as NV_DP_LINK_RATE;
pub const _NV_DP_LANE_COUNT_NV_DP_1_LANE: _NV_DP_LANE_COUNT = 1;
pub const _NV_DP_LANE_COUNT_NV_DP_2_LANE: _NV_DP_LANE_COUNT = 2;
pub const _NV_DP_LANE_COUNT_NV_DP_4_LANE: _NV_DP_LANE_COUNT = 4;
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PORT_INFO."]
pub type _NV_DP_LANE_COUNT = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PORT_INFO."]
pub use self::_NV_DP_LANE_COUNT as NV_DP_LANE_COUNT;
pub const _NV_DP_COLOR_FORMAT_NV_DP_COLOR_FORMAT_RGB: _NV_DP_COLOR_FORMAT = 0;
pub const _NV_DP_COLOR_FORMAT_NV_DP_COLOR_FORMAT_YCbCr422: _NV_DP_COLOR_FORMAT = 1;
pub const _NV_DP_COLOR_FORMAT_NV_DP_COLOR_FORMAT_YCbCr444: _NV_DP_COLOR_FORMAT = 2;
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PORT_INFO."]
pub type _NV_DP_COLOR_FORMAT = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PORT_INFO."]
pub use self::_NV_DP_COLOR_FORMAT as NV_DP_COLOR_FORMAT;
pub const _NV_DP_COLORIMETRY_NV_DP_COLORIMETRY_RGB: _NV_DP_COLORIMETRY = 0;
pub const _NV_DP_COLORIMETRY_NV_DP_COLORIMETRY_YCbCr_ITU601: _NV_DP_COLORIMETRY = 1;
pub const _NV_DP_COLORIMETRY_NV_DP_COLORIMETRY_YCbCr_ITU709: _NV_DP_COLORIMETRY = 2;
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PORT_INFO."]
pub type _NV_DP_COLORIMETRY = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PORT_INFO."]
pub use self::_NV_DP_COLORIMETRY as NV_DP_COLORIMETRY;
pub const _NV_DP_DYNAMIC_RANGE_NV_DP_DYNAMIC_RANGE_VESA: _NV_DP_DYNAMIC_RANGE = 0;
pub const _NV_DP_DYNAMIC_RANGE_NV_DP_DYNAMIC_RANGE_CEA: _NV_DP_DYNAMIC_RANGE = 1;
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PORT_INFO."]
pub type _NV_DP_DYNAMIC_RANGE = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PORT_INFO."]
pub use self::_NV_DP_DYNAMIC_RANGE as NV_DP_DYNAMIC_RANGE;
pub const _NV_DP_BPC_NV_DP_BPC_DEFAULT: _NV_DP_BPC = 0;
pub const _NV_DP_BPC_NV_DP_BPC_6: _NV_DP_BPC = 1;
pub const _NV_DP_BPC_NV_DP_BPC_8: _NV_DP_BPC = 2;
pub const _NV_DP_BPC_NV_DP_BPC_10: _NV_DP_BPC = 3;
pub const _NV_DP_BPC_NV_DP_BPC_12: _NV_DP_BPC = 4;
pub const _NV_DP_BPC_NV_DP_BPC_16: _NV_DP_BPC = 5;
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PORT_INFO."]
pub type _NV_DP_BPC = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PORT_INFO."]
pub use self::_NV_DP_BPC as NV_DP_BPC;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_EDID_V1 {
    pub version: NvU32,
    pub EDID_Data: [NvU8; 256usize],
}
#[test]
fn bindgen_test_layout_NV_EDID_V1() {
    const UNINIT: ::std::mem::MaybeUninit<NV_EDID_V1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_EDID_V1>(),
        260usize,
        concat!("Size of: ", stringify!(NV_EDID_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_EDID_V1>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_EDID_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_EDID_V1),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EDID_Data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_EDID_V1),
            "::",
            stringify!(EDID_Data)
        )
    );
}
#[doc = "! Used in NvAPI_GPU_GetEDID()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_EDID_V2 {
    #[doc = "!< Structure version"]
    pub version: NvU32,
    pub EDID_Data: [NvU8; 256usize],
    pub sizeofEDID: NvU32,
}
#[test]
fn bindgen_test_layout_NV_EDID_V2() {
    const UNINIT: ::std::mem::MaybeUninit<NV_EDID_V2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_EDID_V2>(),
        264usize,
        concat!("Size of: ", stringify!(NV_EDID_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_EDID_V2>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_EDID_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_EDID_V2),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EDID_Data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_EDID_V2),
            "::",
            stringify!(EDID_Data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sizeofEDID) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_EDID_V2),
            "::",
            stringify!(sizeofEDID)
        )
    );
}
#[doc = "! Used in NvAPI_GPU_GetEDID()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_EDID_V3 {
    #[doc = "!< Structure version"]
    pub version: NvU32,
    pub EDID_Data: [NvU8; 256usize],
    pub sizeofEDID: NvU32,
    #[doc = "!< ID which always returned in a monotonically increasing counter.\n!< Across a split-EDID read we need to verify that all calls returned the same edidId.\n!< This counter is incremented if we get the updated EDID."]
    pub edidId: NvU32,
    #[doc = "!< Which 256-byte page of the EDID we want to read. Start at 0.\n!< If the read succeeds with edidSize > NV_EDID_DATA_SIZE,\n!< call back again with offset+256 until we have read the entire buffer"]
    pub offset: NvU32,
}
#[test]
fn bindgen_test_layout_NV_EDID_V3() {
    const UNINIT: ::std::mem::MaybeUninit<NV_EDID_V3> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_EDID_V3>(),
        272usize,
        concat!("Size of: ", stringify!(NV_EDID_V3))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_EDID_V3>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_EDID_V3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_EDID_V3),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EDID_Data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_EDID_V3),
            "::",
            stringify!(EDID_Data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sizeofEDID) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_EDID_V3),
            "::",
            stringify!(sizeofEDID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).edidId) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_EDID_V3),
            "::",
            stringify!(edidId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_EDID_V3),
            "::",
            stringify!(offset)
        )
    );
}
#[doc = "! Used in NvAPI_GPU_GetEDID()"]
pub type NV_EDID = NV_EDID_V3;
extern "C" {
    #[doc = "! \\ingroup gpu"]
    pub fn NvAPI_GPU_GetEDID(
        hPhysicalGpu: NvPhysicalGpuHandle,
        displayOutputId: NvU32,
        pEDID: *mut NV_EDID,
    ) -> NvAPI_Status;
}
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_VGA_15_PIN: _NV_GPU_CONNECTOR_TYPE = 0;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_TV_COMPOSITE: _NV_GPU_CONNECTOR_TYPE = 16;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_TV_SVIDEO: _NV_GPU_CONNECTOR_TYPE = 17;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_TV_HDTV_COMPONENT: _NV_GPU_CONNECTOR_TYPE = 19;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_TV_SCART: _NV_GPU_CONNECTOR_TYPE = 20;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_TV_COMPOSITE_SCART_ON_EIAJ4120:
    _NV_GPU_CONNECTOR_TYPE = 22;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_TV_HDTV_EIAJ4120: _NV_GPU_CONNECTOR_TYPE = 23;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_PC_POD_HDTV_YPRPB: _NV_GPU_CONNECTOR_TYPE = 24;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_PC_POD_SVIDEO: _NV_GPU_CONNECTOR_TYPE = 25;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_PC_POD_COMPOSITE: _NV_GPU_CONNECTOR_TYPE = 26;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DVI_I_TV_SVIDEO: _NV_GPU_CONNECTOR_TYPE = 32;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DVI_I_TV_COMPOSITE: _NV_GPU_CONNECTOR_TYPE =
    33;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DVI_I: _NV_GPU_CONNECTOR_TYPE = 48;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DVI_D: _NV_GPU_CONNECTOR_TYPE = 49;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_ADC: _NV_GPU_CONNECTOR_TYPE = 50;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_LFH_DVI_I_1: _NV_GPU_CONNECTOR_TYPE = 56;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_LFH_DVI_I_2: _NV_GPU_CONNECTOR_TYPE = 57;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_SPWG: _NV_GPU_CONNECTOR_TYPE = 64;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_OEM: _NV_GPU_CONNECTOR_TYPE = 65;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DISPLAYPORT_EXTERNAL: _NV_GPU_CONNECTOR_TYPE =
    70;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DISPLAYPORT_INTERNAL: _NV_GPU_CONNECTOR_TYPE =
    71;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DISPLAYPORT_MINI_EXT: _NV_GPU_CONNECTOR_TYPE =
    72;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_HDMI_A: _NV_GPU_CONNECTOR_TYPE = 97;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_HDMI_C_MINI: _NV_GPU_CONNECTOR_TYPE = 99;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_LFH_DISPLAYPORT_1: _NV_GPU_CONNECTOR_TYPE =
    100;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_LFH_DISPLAYPORT_2: _NV_GPU_CONNECTOR_TYPE =
    101;
#[doc = "!< Deprecated."]
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_VIRTUAL_WFD: _NV_GPU_CONNECTOR_TYPE = 112;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_USB_C: _NV_GPU_CONNECTOR_TYPE = 113;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_UNKNOWN: _NV_GPU_CONNECTOR_TYPE = -1;
#[doc = "! \\ingroup gpu\n! Used in NV_GPU_CONNECTOR_DATA"]
pub type _NV_GPU_CONNECTOR_TYPE = ::std::os::raw::c_int;
#[doc = "! \\ingroup gpu\n! Used in NV_GPU_CONNECTOR_DATA"]
pub use self::_NV_GPU_CONNECTOR_TYPE as NV_GPU_CONNECTOR_TYPE;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_NONE: _NV_DISPLAY_TV_FORMAT = 0;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_NTSCM: _NV_DISPLAY_TV_FORMAT = 1;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_NTSCJ: _NV_DISPLAY_TV_FORMAT = 2;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_PALM: _NV_DISPLAY_TV_FORMAT = 4;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_PALBDGH: _NV_DISPLAY_TV_FORMAT = 8;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_PALN: _NV_DISPLAY_TV_FORMAT = 16;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_PALNC: _NV_DISPLAY_TV_FORMAT = 32;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_576i: _NV_DISPLAY_TV_FORMAT = 256;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_480i: _NV_DISPLAY_TV_FORMAT = 512;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_ED_480p: _NV_DISPLAY_TV_FORMAT = 1024;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_ED_576p: _NV_DISPLAY_TV_FORMAT = 2048;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_720p: _NV_DISPLAY_TV_FORMAT = 4096;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_1080i: _NV_DISPLAY_TV_FORMAT = 8192;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_1080p: _NV_DISPLAY_TV_FORMAT = 16384;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_720p50: _NV_DISPLAY_TV_FORMAT = 32768;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_1080p24: _NV_DISPLAY_TV_FORMAT = 65536;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_1080i50: _NV_DISPLAY_TV_FORMAT = 131072;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_1080p50: _NV_DISPLAY_TV_FORMAT = 262144;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp30: _NV_DISPLAY_TV_FORMAT = 524288;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp30_3840: _NV_DISPLAY_TV_FORMAT = 524288;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp25: _NV_DISPLAY_TV_FORMAT = 1048576;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp25_3840: _NV_DISPLAY_TV_FORMAT =
    1048576;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp24: _NV_DISPLAY_TV_FORMAT = 2097152;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp24_3840: _NV_DISPLAY_TV_FORMAT =
    2097152;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp24_SMPTE: _NV_DISPLAY_TV_FORMAT =
    4194304;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp50_3840: _NV_DISPLAY_TV_FORMAT =
    8388608;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp60_3840: _NV_DISPLAY_TV_FORMAT =
    9437184;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp30_4096: _NV_DISPLAY_TV_FORMAT =
    10485760;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp25_4096: _NV_DISPLAY_TV_FORMAT =
    11534336;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp24_4096: _NV_DISPLAY_TV_FORMAT =
    12582912;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp50_4096: _NV_DISPLAY_TV_FORMAT =
    13631488;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp60_4096: _NV_DISPLAY_TV_FORMAT =
    14680064;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp24_7680: _NV_DISPLAY_TV_FORMAT =
    16777216;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp25_7680: _NV_DISPLAY_TV_FORMAT =
    33554432;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp30_7680: _NV_DISPLAY_TV_FORMAT =
    67108864;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp48_7680: _NV_DISPLAY_TV_FORMAT =
    134217728;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp50_7680: _NV_DISPLAY_TV_FORMAT =
    150994944;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp60_7680: _NV_DISPLAY_TV_FORMAT =
    167772160;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp100_7680: _NV_DISPLAY_TV_FORMAT =
    184549376;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp120_7680: _NV_DISPLAY_TV_FORMAT =
    201326592;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp48_3840: _NV_DISPLAY_TV_FORMAT =
    218103808;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp48_4096: _NV_DISPLAY_TV_FORMAT =
    234881024;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp100_4096: _NV_DISPLAY_TV_FORMAT =
    251658240;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp100_3840: _NV_DISPLAY_TV_FORMAT =
    268435456;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp120_4096: _NV_DISPLAY_TV_FORMAT =
    285212672;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp120_3840: _NV_DISPLAY_TV_FORMAT =
    301989888;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp100_5120: _NV_DISPLAY_TV_FORMAT =
    318767104;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp120_5120: _NV_DISPLAY_TV_FORMAT =
    335544320;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp24_5120: _NV_DISPLAY_TV_FORMAT =
    352321536;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp25_5120: _NV_DISPLAY_TV_FORMAT =
    369098752;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp30_5120: _NV_DISPLAY_TV_FORMAT =
    385875968;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp48_5120: _NV_DISPLAY_TV_FORMAT =
    402653184;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp50_5120: _NV_DISPLAY_TV_FORMAT =
    419430400;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp60_5120: _NV_DISPLAY_TV_FORMAT =
    536870912;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp24_10240: _NV_DISPLAY_TV_FORMAT =
    553648128;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp25_10240: _NV_DISPLAY_TV_FORMAT =
    570425344;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp30_10240: _NV_DISPLAY_TV_FORMAT =
    587202560;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp48_10240: _NV_DISPLAY_TV_FORMAT =
    603979776;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp50_10240: _NV_DISPLAY_TV_FORMAT =
    620756992;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp60_10240: _NV_DISPLAY_TV_FORMAT =
    637534208;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp100_10240: _NV_DISPLAY_TV_FORMAT =
    654311424;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp120_10240: _NV_DISPLAY_TV_FORMAT =
    671088640;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_OTHER: _NV_DISPLAY_TV_FORMAT = 805306368;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_ED_OTHER: _NV_DISPLAY_TV_FORMAT = 1073741824;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_OTHER: _NV_DISPLAY_TV_FORMAT = 1342177280;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_ANY: _NV_DISPLAY_TV_FORMAT = -2147483648;
#[doc = "! \\ingroup tvapi\n! Used in NV_DISPLAY_TV_OUTPUT_INFO"]
pub type _NV_DISPLAY_TV_FORMAT = ::std::os::raw::c_int;
#[doc = "! \\ingroup tvapi\n! Used in NV_DISPLAY_TV_OUTPUT_INFO"]
pub use self::_NV_DISPLAY_TV_FORMAT as NV_DISPLAY_TV_FORMAT;
pub const _NV_TARGET_VIEW_MODE_NV_VIEW_MODE_STANDARD: _NV_TARGET_VIEW_MODE = 0;
pub const _NV_TARGET_VIEW_MODE_NV_VIEW_MODE_CLONE: _NV_TARGET_VIEW_MODE = 1;
pub const _NV_TARGET_VIEW_MODE_NV_VIEW_MODE_HSPAN: _NV_TARGET_VIEW_MODE = 2;
pub const _NV_TARGET_VIEW_MODE_NV_VIEW_MODE_VSPAN: _NV_TARGET_VIEW_MODE = 3;
pub const _NV_TARGET_VIEW_MODE_NV_VIEW_MODE_DUALVIEW: _NV_TARGET_VIEW_MODE = 4;
pub const _NV_TARGET_VIEW_MODE_NV_VIEW_MODE_MULTIVIEW: _NV_TARGET_VIEW_MODE = 5;
#[doc = "! Used in NvAPI_SetView()."]
pub type _NV_TARGET_VIEW_MODE = ::std::os::raw::c_int;
#[doc = "! Used in NvAPI_SetView()."]
pub use self::_NV_TARGET_VIEW_MODE as NV_TARGET_VIEW_MODE;
#[doc = "!< No change"]
pub const _NV_SCALING_NV_SCALING_DEFAULT: _NV_SCALING = 0;
#[doc = "!< Balanced  - Full Screen"]
pub const _NV_SCALING_NV_SCALING_GPU_SCALING_TO_CLOSEST: _NV_SCALING = 1;
#[doc = "!< Force GPU - Full Screen"]
pub const _NV_SCALING_NV_SCALING_GPU_SCALING_TO_NATIVE: _NV_SCALING = 2;
#[doc = "!< Force GPU - Centered\\No Scaling"]
pub const _NV_SCALING_NV_SCALING_GPU_SCANOUT_TO_NATIVE: _NV_SCALING = 3;
#[doc = "!< Force GPU - Aspect Ratio"]
pub const _NV_SCALING_NV_SCALING_GPU_SCALING_TO_ASPECT_SCANOUT_TO_NATIVE: _NV_SCALING = 5;
#[doc = "!< Balanced  - Aspect Ratio"]
pub const _NV_SCALING_NV_SCALING_GPU_SCALING_TO_ASPECT_SCANOUT_TO_CLOSEST: _NV_SCALING = 6;
#[doc = "!< Balanced  - Centered\\No Scaling"]
pub const _NV_SCALING_NV_SCALING_GPU_SCANOUT_TO_CLOSEST: _NV_SCALING = 7;
#[doc = "!< Force GPU - Integer Scaling"]
pub const _NV_SCALING_NV_SCALING_GPU_INTEGER_ASPECT_SCALING: _NV_SCALING = 8;
pub const _NV_SCALING_NV_SCALING_MONITOR_SCALING: _NV_SCALING = 1;
pub const _NV_SCALING_NV_SCALING_ADAPTER_SCALING: _NV_SCALING = 2;
pub const _NV_SCALING_NV_SCALING_CENTERED: _NV_SCALING = 3;
pub const _NV_SCALING_NV_SCALING_ASPECT_SCALING: _NV_SCALING = 5;
#[doc = "!< For future use"]
pub const _NV_SCALING_NV_SCALING_CUSTOMIZED: _NV_SCALING = 255;
#[doc = "! Scaling modes - used in NvAPI_SetViewEx().\n! \\ingroup dispcontrol"]
pub type _NV_SCALING = ::std::os::raw::c_int;
#[doc = "! Scaling modes - used in NvAPI_SetViewEx().\n! \\ingroup dispcontrol"]
pub use self::_NV_SCALING as NV_SCALING;
pub const _NV_ROTATE_NV_ROTATE_0: _NV_ROTATE = 0;
pub const _NV_ROTATE_NV_ROTATE_90: _NV_ROTATE = 1;
pub const _NV_ROTATE_NV_ROTATE_180: _NV_ROTATE = 2;
pub const _NV_ROTATE_NV_ROTATE_270: _NV_ROTATE = 3;
pub const _NV_ROTATE_NV_ROTATE_IGNORED: _NV_ROTATE = 4;
#[doc = "! \\ingroup dispcontrol"]
pub type _NV_ROTATE = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
pub use self::_NV_ROTATE as NV_ROTATE;
#[doc = "!< unknown. Driver will choose one as following value."]
pub const _NV_FORMAT_NV_FORMAT_UNKNOWN: _NV_FORMAT = 0;
#[doc = "!< for 8bpp mode"]
pub const _NV_FORMAT_NV_FORMAT_P8: _NV_FORMAT = 41;
#[doc = "!< for 16bpp mode"]
pub const _NV_FORMAT_NV_FORMAT_R5G6B5: _NV_FORMAT = 23;
#[doc = "!< for 32bpp mode"]
pub const _NV_FORMAT_NV_FORMAT_A8R8G8B8: _NV_FORMAT = 21;
#[doc = "!< for 64bpp(floating point) mode."]
pub const _NV_FORMAT_NV_FORMAT_A16B16G16R16F: _NV_FORMAT = 113;
#[doc = "! Color formats- used in NvAPI_SetViewEx().\n! \\ingroup dispcontrol"]
pub type _NV_FORMAT = ::std::os::raw::c_int;
#[doc = "! Color formats- used in NvAPI_SetViewEx().\n! \\ingroup dispcontrol"]
pub use self::_NV_FORMAT as NV_FORMAT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_VIEWPORTF {
    #[doc = "!<  x-coordinate of the viewport top-left point"]
    pub x: f32,
    #[doc = "!<  y-coordinate of the viewport top-left point"]
    pub y: f32,
    #[doc = "!<  Width of the viewport"]
    pub w: f32,
    #[doc = "!<  Height of the viewport"]
    pub h: f32,
}
#[test]
fn bindgen_test_layout_NV_VIEWPORTF() {
    const UNINIT: ::std::mem::MaybeUninit<NV_VIEWPORTF> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_VIEWPORTF>(),
        16usize,
        concat!("Size of: ", stringify!(NV_VIEWPORTF))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_VIEWPORTF>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_VIEWPORTF))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_VIEWPORTF),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_VIEWPORTF),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_VIEWPORTF),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_VIEWPORTF),
            "::",
            stringify!(h)
        )
    );
}
#[doc = "!< get the current timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_CURRENT: _NV_TIMING_OVERRIDE = 0;
#[doc = "!< the timing the driver will use based the current policy"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_AUTO: _NV_TIMING_OVERRIDE = 1;
#[doc = "!< EDID timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_EDID: _NV_TIMING_OVERRIDE = 2;
#[doc = "!< VESA DMT timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_DMT: _NV_TIMING_OVERRIDE = 3;
#[doc = "!< VESA DMT timing with reduced blanking"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_DMT_RB: _NV_TIMING_OVERRIDE = 4;
#[doc = "!< VESA CVT timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_CVT: _NV_TIMING_OVERRIDE = 5;
#[doc = "!< VESA CVT timing with reduced blanking"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_CVT_RB: _NV_TIMING_OVERRIDE = 6;
#[doc = "!< VESA GTF timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_GTF: _NV_TIMING_OVERRIDE = 7;
#[doc = "!< EIA 861x pre-defined timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_EIA861: _NV_TIMING_OVERRIDE = 8;
#[doc = "!< analog SD/HDTV timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_ANALOG_TV: _NV_TIMING_OVERRIDE = 9;
#[doc = "!< NV custom timings"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_CUST: _NV_TIMING_OVERRIDE = 10;
#[doc = "!< NV pre-defined timing (basically the PsF timings)"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_NV_PREDEFINED: _NV_TIMING_OVERRIDE = 11;
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_NV_PSF: _NV_TIMING_OVERRIDE = 11;
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_NV_ASPR: _NV_TIMING_OVERRIDE = 12;
#[doc = "!< Override for SDI timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_SDI: _NV_TIMING_OVERRIDE = 13;
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVRRIDE_MAX: _NV_TIMING_OVERRIDE = 14;
#[doc = "! \\ingroup dispcontrol\n! The timing override is not supported yet; must be set to _AUTO. \\n"]
pub type _NV_TIMING_OVERRIDE = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol\n! The timing override is not supported yet; must be set to _AUTO. \\n"]
pub use self::_NV_TIMING_OVERRIDE as NV_TIMING_OVERRIDE;
#[doc = "! \\ingroup dispcontrol\n!  NVIDIA-specific timing extras \\n\n! Used in NV_TIMING."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagNV_TIMINGEXT {
    #[doc = "!< Reserved for NVIDIA hardware-based enhancement, such as double-scan."]
    pub flag: NvU32,
    #[doc = "!< Logical refresh rate to present"]
    pub rr: NvU16,
    #[doc = "!< Physical vertical refresh rate in 0.001Hz"]
    pub rrx1k: NvU32,
    #[doc = "!< Display aspect ratio Hi(aspect):horizontal-aspect, Low(aspect):vertical-aspect"]
    pub aspect: NvU32,
    #[doc = "!< Bit-wise pixel repetition factor: 0x1:no pixel repetition; 0x2:each pixel repeats twice horizontally,.."]
    pub rep: NvU16,
    #[doc = "!< Timing standard"]
    pub status: NvU32,
    #[doc = "!< Timing name"]
    pub name: [NvU8; 40usize],
}
#[test]
fn bindgen_test_layout_tagNV_TIMINGEXT() {
    const UNINIT: ::std::mem::MaybeUninit<tagNV_TIMINGEXT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tagNV_TIMINGEXT>(),
        64usize,
        concat!("Size of: ", stringify!(tagNV_TIMINGEXT))
    );
    assert_eq!(
        ::std::mem::align_of::<tagNV_TIMINGEXT>(),
        4usize,
        concat!("Alignment of ", stringify!(tagNV_TIMINGEXT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagNV_TIMINGEXT),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tagNV_TIMINGEXT),
            "::",
            stringify!(rr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rrx1k) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tagNV_TIMINGEXT),
            "::",
            stringify!(rrx1k)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aspect) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tagNV_TIMINGEXT),
            "::",
            stringify!(aspect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rep) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tagNV_TIMINGEXT),
            "::",
            stringify!(rep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tagNV_TIMINGEXT),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tagNV_TIMINGEXT),
            "::",
            stringify!(name)
        )
    );
}
#[doc = "! \\ingroup dispcontrol\n!  NVIDIA-specific timing extras \\n\n! Used in NV_TIMING."]
pub type NV_TIMINGEXT = tagNV_TIMINGEXT;
#[doc = "! \\ingroup dispcontrol\n!The very basic timing structure based on the VESA standard:\n! \\code\n!            |<----------------------------htotal--------------------------->|\n!             ---------\"active\" video-------->|<-------blanking------>|<-----\n!            |<-------hvisible-------->|<-hb->|<-hfp->|<-hsw->|<-hbp->|<-hb->|\n! --------- -+-------------------------+      |       |       |       |      |\n!   A      A |                         |      |       |       |       |      |\n!   :      : |                         |      |       |       |       |      |\n!   :      : |                         |      |       |       |       |      |\n!   :vertical|    addressable video    |      |       |       |       |      |\n!   : visible|                         |      |       |       |       |      |\n!   :      : |                         |      |       |       |       |      |\n!   :      : |                         |      |       |       |       |      |\n! vertical V |                         |      |       |       |       |      |\n!  total   --+-------------------------+      |       |       |       |      |\n!   :      vb         border                  |       |       |       |      |\n!   :      -----------------------------------+       |       |       |      |\n!   :      vfp        front porch                     |       |       |      |\n!   :      -------------------------------------------+       |       |      |\n!   :      vsw        sync width                              |       |      |\n!   :      ---------------------------------------------------+       |      |\n!   :      vbp        back porch                                      |      |\n!   :      -----------------------------------------------------------+      |\n!   V      vb         border                                                 |\n! ---------------------------------------------------------------------------+\n! \\endcode"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_TIMING {
    #[doc = "!< horizontal visible"]
    pub HVisible: NvU16,
    #[doc = "!< horizontal border"]
    pub HBorder: NvU16,
    #[doc = "!< horizontal front porch"]
    pub HFrontPorch: NvU16,
    #[doc = "!< horizontal sync width"]
    pub HSyncWidth: NvU16,
    #[doc = "!< horizontal total"]
    pub HTotal: NvU16,
    #[doc = "!< horizontal sync polarity: 1-negative, 0-positive"]
    pub HSyncPol: NvU8,
    #[doc = "!< vertical visible"]
    pub VVisible: NvU16,
    #[doc = "!< vertical border"]
    pub VBorder: NvU16,
    #[doc = "!< vertical front porch"]
    pub VFrontPorch: NvU16,
    #[doc = "!< vertical sync width"]
    pub VSyncWidth: NvU16,
    #[doc = "!< vertical total"]
    pub VTotal: NvU16,
    #[doc = "!< vertical sync polarity: 1-negative, 0-positive"]
    pub VSyncPol: NvU8,
    #[doc = "!< 1-interlaced, 0-progressive"]
    pub interlaced: NvU16,
    #[doc = "!< pixel clock in 10 kHz"]
    pub pclk: NvU32,
    pub etc: NV_TIMINGEXT,
}
#[test]
fn bindgen_test_layout__NV_TIMING() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_TIMING> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_TIMING>(),
        96usize,
        concat!("Size of: ", stringify!(_NV_TIMING))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_TIMING>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_TIMING))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HVisible) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(HVisible)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HBorder) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(HBorder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HFrontPorch) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(HFrontPorch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HSyncWidth) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(HSyncWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HTotal) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(HTotal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HSyncPol) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(HSyncPol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VVisible) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(VVisible)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VBorder) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(VBorder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VFrontPorch) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(VFrontPorch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VSyncWidth) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(VSyncWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VTotal) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(VTotal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VSyncPol) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(VSyncPol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interlaced) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(interlaced)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pclk) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(pclk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).etc) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_TIMING),
            "::",
            stringify!(etc)
        )
    );
}
#[doc = "! \\ingroup dispcontrol\n!The very basic timing structure based on the VESA standard:\n! \\code\n!            |<----------------------------htotal--------------------------->|\n!             ---------\"active\" video-------->|<-------blanking------>|<-----\n!            |<-------hvisible-------->|<-hb->|<-hfp->|<-hsw->|<-hbp->|<-hb->|\n! --------- -+-------------------------+      |       |       |       |      |\n!   A      A |                         |      |       |       |       |      |\n!   :      : |                         |      |       |       |       |      |\n!   :      : |                         |      |       |       |       |      |\n!   :vertical|    addressable video    |      |       |       |       |      |\n!   : visible|                         |      |       |       |       |      |\n!   :      : |                         |      |       |       |       |      |\n!   :      : |                         |      |       |       |       |      |\n! vertical V |                         |      |       |       |       |      |\n!  total   --+-------------------------+      |       |       |       |      |\n!   :      vb         border                  |       |       |       |      |\n!   :      -----------------------------------+       |       |       |      |\n!   :      vfp        front porch                     |       |       |      |\n!   :      -------------------------------------------+       |       |      |\n!   :      vsw        sync width                              |       |      |\n!   :      ---------------------------------------------------+       |      |\n!   :      vbp        back porch                                      |      |\n!   :      -----------------------------------------------------------+      |\n!   V      vb         border                                                 |\n! ---------------------------------------------------------------------------+\n! \\endcode"]
pub type NV_TIMING = _NV_TIMING;
#[doc = "! \\ingroup dispcontrol\n! Used in NvAPI_SetView() and NvAPI_GetView()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_VIEW_TARGET_INFO {
    #[doc = "!< (IN) structure version"]
    pub version: NvU32,
    #[doc = "!< (IN) target count"]
    pub count: NvU32,
    pub target: [NV_VIEW_TARGET_INFO__bindgen_ty_1; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_VIEW_TARGET_INFO__bindgen_ty_1 {
    #[doc = "!< (IN/OUT) Device mask"]
    pub deviceMask: NvU32,
    #[doc = "!< (IN/OUT) Source ID - values will be based on the number of heads exposed per GPU."]
    pub sourceId: NvU32,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_NV_VIEW_TARGET_INFO__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<NV_VIEW_TARGET_INFO__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_VIEW_TARGET_INFO__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(NV_VIEW_TARGET_INFO__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_VIEW_TARGET_INFO__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_VIEW_TARGET_INFO__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deviceMask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_VIEW_TARGET_INFO__bindgen_ty_1),
            "::",
            stringify!(deviceMask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceId) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_VIEW_TARGET_INFO__bindgen_ty_1),
            "::",
            stringify!(sourceId)
        )
    );
}
impl NV_VIEW_TARGET_INFO__bindgen_ty_1 {
    #[inline]
    pub fn bPrimary(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bPrimary(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bInterlaced(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bInterlaced(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bGDIPrimary(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bGDIPrimary(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bForceModeSet(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bForceModeSet(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bPrimary: NvU32,
        bInterlaced: NvU32,
        bGDIPrimary: NvU32,
        bForceModeSet: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bPrimary: u32 = unsafe { ::std::mem::transmute(bPrimary) };
            bPrimary as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bInterlaced: u32 = unsafe { ::std::mem::transmute(bInterlaced) };
            bInterlaced as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bGDIPrimary: u32 = unsafe { ::std::mem::transmute(bGDIPrimary) };
            bGDIPrimary as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bForceModeSet: u32 = unsafe { ::std::mem::transmute(bForceModeSet) };
            bForceModeSet as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_NV_VIEW_TARGET_INFO() {
    const UNINIT: ::std::mem::MaybeUninit<NV_VIEW_TARGET_INFO> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_VIEW_TARGET_INFO>(),
        32usize,
        concat!("Size of: ", stringify!(NV_VIEW_TARGET_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_VIEW_TARGET_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_VIEW_TARGET_INFO))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_VIEW_TARGET_INFO),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_VIEW_TARGET_INFO),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_VIEW_TARGET_INFO),
            "::",
            stringify!(target)
        )
    );
}
extern "C" {
    #[doc = "! \\ingroup dispcontrol"]
    pub fn NvAPI_SetView(
        hNvDisplay: NvDisplayHandle,
        pTargetInfo: *mut NV_VIEW_TARGET_INFO,
        targetView: NV_TARGET_VIEW_MODE,
    ) -> NvAPI_Status;
}
#[doc = "! \\ingroup dispcontrol\n! Used in NV_DISPLAY_PATH_INFO."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_DISPLAY_PATH {
    #[doc = "!< (IN) Device mask"]
    pub deviceMask: NvU32,
    #[doc = "!< (IN) Values will be based on the number of heads exposed per GPU(0, 1?)"]
    pub sourceId: NvU32,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "!< (IN) Specify connector type. For TV only."]
    pub connector: NV_GPU_CONNECTOR_TYPE,
    #[doc = "!< (IN) Width of the mode"]
    pub width: NvU32,
    #[doc = "!< (IN) Height of the mode"]
    pub height: NvU32,
    #[doc = "!< (IN) Depth of the mode"]
    pub depth: NvU32,
    #[doc = "!<      Color format if it needs to be specified. Not used now."]
    pub colorFormat: NV_FORMAT,
    #[doc = "!< (IN) Rotation setting."]
    pub rotation: NV_ROTATE,
    #[doc = "!< (IN) Scaling setting"]
    pub scaling: NV_SCALING,
    #[doc = "!< (IN) Refresh rate of the mode"]
    pub refreshRate: NvU32,
    pub _bitfield_align_2: [u8; 0],
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "!< (IN) To choose the last TV format set this value to NV_DISPLAY_TV_FORMAT_NONE"]
    pub tvFormat: NV_DISPLAY_TV_FORMAT,
    #[doc = "!< (IN/OUT) X-offset of this display on the Windows desktop"]
    pub posx: NvU32,
    #[doc = "!< (IN/OUT) Y-offset of this display on the Windows desktop"]
    pub posy: NvU32,
    pub _bitfield_align_3: [u32; 0],
    pub _bitfield_3: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_PATH() {
    const UNINIT: ::std::mem::MaybeUninit<NV_DISPLAY_PATH> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_PATH>(),
        64usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_PATH))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_PATH>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_DISPLAY_PATH))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deviceMask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(deviceMask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceId) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(sourceId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connector) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(connector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).depth) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colorFormat) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(colorFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotation) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(rotation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scaling) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(scaling)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refreshRate) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(refreshRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tvFormat) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(tvFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).posx) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(posx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).posy) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH),
            "::",
            stringify!(posy)
        )
    );
}
impl NV_DISPLAY_PATH {
    #[inline]
    pub fn bPrimary(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bPrimary(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(bPrimary: NvU32) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bPrimary: u32 = unsafe { ::std::mem::transmute(bPrimary) };
            bPrimary as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn interlaced(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_interlaced(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_2.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_2(interlaced: NvU32) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let interlaced: u32 = unsafe { ::std::mem::transmute(interlaced) };
            interlaced as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn bGDIPrimary(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_3.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bGDIPrimary(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_3.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bForceModeSet(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_3.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bForceModeSet(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_3.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bFocusDisplay(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_3.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bFocusDisplay(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_3.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn gpuId(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_3.get(3usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_gpuId(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_3.set(3usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_3(
        bGDIPrimary: NvU32,
        bForceModeSet: NvU32,
        bFocusDisplay: NvU32,
        gpuId: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bGDIPrimary: u32 = unsafe { ::std::mem::transmute(bGDIPrimary) };
            bGDIPrimary as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bForceModeSet: u32 = unsafe { ::std::mem::transmute(bForceModeSet) };
            bForceModeSet as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bFocusDisplay: u32 = unsafe { ::std::mem::transmute(bFocusDisplay) };
            bFocusDisplay as u64
        });
        __bindgen_bitfield_unit.set(3usize, 24u8, {
            let gpuId: u32 = unsafe { ::std::mem::transmute(gpuId) };
            gpuId as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! \\ingroup dispcontrol\n! Used in NvAPI_SetViewEx() and NvAPI_GetViewEx()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_DISPLAY_PATH_INFO_V3 {
    #[doc = "!< (IN) Structure version"]
    pub version: NvU32,
    #[doc = "!< (IN) Path count"]
    pub count: NvU32,
    pub path: [NV_DISPLAY_PATH; 2usize],
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_PATH_INFO_V3() {
    const UNINIT: ::std::mem::MaybeUninit<NV_DISPLAY_PATH_INFO_V3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_PATH_INFO_V3>(),
        136usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_PATH_INFO_V3))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_PATH_INFO_V3>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_DISPLAY_PATH_INFO_V3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH_INFO_V3),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH_INFO_V3),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH_INFO_V3),
            "::",
            stringify!(path)
        )
    );
}
#[doc = "! \\ingroup dispcontrol\n! Used in NvAPI_SetViewEx() and NvAPI_GetViewEx()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_DISPLAY_PATH_INFO {
    #[doc = "!< (IN) Structure version"]
    pub version: NvU32,
    #[doc = "!< (IN) Path count"]
    pub count: NvU32,
    pub path: [NV_DISPLAY_PATH; 4usize],
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_PATH_INFO() {
    const UNINIT: ::std::mem::MaybeUninit<NV_DISPLAY_PATH_INFO> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_PATH_INFO>(),
        264usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_PATH_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_PATH_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_DISPLAY_PATH_INFO))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH_INFO),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH_INFO),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_PATH_INFO),
            "::",
            stringify!(path)
        )
    );
}
extern "C" {
    #[doc = "! \\ingroup dispcontrol"]
    pub fn NvAPI_SetViewEx(
        hNvDisplay: NvDisplayHandle,
        pPathInfo: *mut NV_DISPLAY_PATH_INFO,
        displayView: NV_TARGET_VIEW_MODE,
    ) -> NvAPI_Status;
}
#[doc = "\n! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_POSITION {
    pub x: NvS32,
    pub y: NvS32,
}
#[test]
fn bindgen_test_layout__NV_POSITION() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_POSITION> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_POSITION>(),
        8usize,
        concat!("Size of: ", stringify!(_NV_POSITION))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_POSITION>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_POSITION))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_POSITION),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_POSITION),
            "::",
            stringify!(y)
        )
    );
}
#[doc = "\n! \\ingroup dispcontrol"]
pub type NV_POSITION = _NV_POSITION;
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_RESOLUTION {
    pub width: NvU32,
    pub height: NvU32,
    pub colorDepth: NvU32,
}
#[test]
fn bindgen_test_layout__NV_RESOLUTION() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_RESOLUTION> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_RESOLUTION>(),
        12usize,
        concat!("Size of: ", stringify!(_NV_RESOLUTION))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_RESOLUTION>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_RESOLUTION))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_RESOLUTION),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_RESOLUTION),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colorDepth) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_RESOLUTION),
            "::",
            stringify!(colorDepth)
        )
    );
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_RESOLUTION = _NV_RESOLUTION;
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1 {
    pub version: NvU32,
    #[doc = "!< (IN) rotation setting."]
    pub rotation: NV_ROTATE,
    #[doc = "!< (IN) scaling setting."]
    pub scaling: NV_SCALING,
    #[doc = "!< (IN) Non-interlaced Refresh Rate of the mode, multiplied by 1000, 0 = ignored\n!< This is the value which driver reports to the OS."]
    pub refreshRate1K: NvU32,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "!< Specify connector type. For TV only, ignored if tvFormat == NV_DISPLAY_TV_FORMAT_NONE"]
    pub connector: NV_GPU_CONNECTOR_TYPE,
    #[doc = "!< (IN) to choose the last TV format set this value to NV_DISPLAY_TV_FORMAT_NONE\n!< In case of NvAPI_DISP_GetDisplayConfig(), this field will indicate the currently applied TV format;\n!< if no TV format is applied, this field will have NV_DISPLAY_TV_FORMAT_NONE value.\n!< In case of NvAPI_DISP_SetDisplayConfig(), this field should only be set in case of TVs;\n!< for other displays this field will be ignored and resolution & refresh rate specified in input will be used to apply the TV format."]
    pub tvFormat: NV_DISPLAY_TV_FORMAT,
    #[doc = "!< Ignored if timingOverride == NV_TIMING_OVERRIDE_CURRENT"]
    pub timingOverride: NV_TIMING_OVERRIDE,
    #[doc = "!< Scan out timing, valid only if timingOverride == NV_TIMING_OVERRIDE_CUST\n!< The value NV_TIMING::NV_TIMINGEXT::rrx1k is obtained from the EDID. The driver may\n!< tweak this value for HDTV, stereo, etc., before reporting it to the OS."]
    pub timing: NV_TIMING,
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1>(),
        128usize,
        concat!(
            "Size of: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotation) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
            "::",
            stringify!(rotation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scaling) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
            "::",
            stringify!(scaling)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refreshRate1K) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
            "::",
            stringify!(refreshRate1K)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connector) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
            "::",
            stringify!(connector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tvFormat) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
            "::",
            stringify!(tvFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timingOverride) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
            "::",
            stringify!(timingOverride)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timing) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
            "::",
            stringify!(timing)
        )
    );
}
impl _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1 {
    #[inline]
    pub fn interlaced(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_interlaced(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn primary(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_primary(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reservedBit1(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reservedBit1(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disableVirtualModeSupport(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disableVirtualModeSupport(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isPreferredUnscaledTarget(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isPreferredUnscaledTarget(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 27u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 27u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        interlaced: NvU32,
        primary: NvU32,
        reservedBit1: NvU32,
        disableVirtualModeSupport: NvU32,
        isPreferredUnscaledTarget: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let interlaced: u32 = unsafe { ::std::mem::transmute(interlaced) };
            interlaced as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let primary: u32 = unsafe { ::std::mem::transmute(primary) };
            primary as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let reservedBit1: u32 = unsafe { ::std::mem::transmute(reservedBit1) };
            reservedBit1 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let disableVirtualModeSupport: u32 =
                unsafe { ::std::mem::transmute(disableVirtualModeSupport) };
            disableVirtualModeSupport as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let isPreferredUnscaledTarget: u32 =
                unsafe { ::std::mem::transmute(isPreferredUnscaledTarget) };
            isPreferredUnscaledTarget as u64
        });
        __bindgen_bitfield_unit.set(5usize, 27u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1 =
    _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1;
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO = NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1;
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1 {
    #[doc = "!< Display ID"]
    pub displayId: NvU32,
    #[doc = "!< May be NULL if no advanced settings are required. NULL for Non-NVIDIA Display."]
    pub details: *mut NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO,
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).displayId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1),
            "::",
            stringify!(displayId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).details) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1),
            "::",
            stringify!(details)
        )
    );
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1 = _NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1;
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2 {
    #[doc = "!< Display ID"]
    pub displayId: NvU32,
    #[doc = "!< May be NULL if no advanced settings are required"]
    pub details: *mut NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO,
    #[doc = "!< Windows CCD target ID. Must be present only for non-NVIDIA adapter, for NVIDIA adapter this parameter is ignored."]
    pub targetId: NvU32,
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).displayId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2),
            "::",
            stringify!(displayId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).details) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2),
            "::",
            stringify!(details)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).targetId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2),
            "::",
            stringify!(targetId)
        )
    );
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2 = _NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2;
#[doc = "! \\ingroup dispcontrol\n! As version is not defined for this structure, we will be using version of NV_DISPLAYCONFIG_PATH_INFO"]
pub type NV_DISPLAYCONFIG_PATH_TARGET_INFO = NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2;
pub const _NV_DISPLAYCONFIG_SPANNING_ORIENTATION_NV_DISPLAYCONFIG_SPAN_NONE:
    _NV_DISPLAYCONFIG_SPANNING_ORIENTATION = 0;
pub const _NV_DISPLAYCONFIG_SPANNING_ORIENTATION_NV_DISPLAYCONFIG_SPAN_HORIZONTAL:
    _NV_DISPLAYCONFIG_SPANNING_ORIENTATION = 1;
pub const _NV_DISPLAYCONFIG_SPANNING_ORIENTATION_NV_DISPLAYCONFIG_SPAN_VERTICAL:
    _NV_DISPLAYCONFIG_SPANNING_ORIENTATION = 2;
#[doc = "! \\ingroup dispcontrol"]
pub type _NV_DISPLAYCONFIG_SPANNING_ORIENTATION = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
pub use self::_NV_DISPLAYCONFIG_SPANNING_ORIENTATION as NV_DISPLAYCONFIG_SPANNING_ORIENTATION;
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1 {
    pub resolution: NV_RESOLUTION,
    #[doc = "!< Ignored at present, must be NV_FORMAT_UNKNOWN (0)"]
    pub colorFormat: NV_FORMAT,
    #[doc = "!< Is all positions are 0 or invalid, displays will be automatically\n!< positioned from left to right with GDI Primary at 0,0, and all\n!< other displays in the order of the path array."]
    pub position: NV_POSITION,
    #[doc = "!< Spanning is only supported on XP"]
    pub spanningOrientation: NV_DISPLAYCONFIG_SPANNING_ORIENTATION,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resolution) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1),
            "::",
            stringify!(resolution)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colorFormat) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1),
            "::",
            stringify!(colorFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).position) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spanningOrientation) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1),
            "::",
            stringify!(spanningOrientation)
        )
    );
}
impl _NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1 {
    #[inline]
    pub fn bGDIPrimary(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bGDIPrimary(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bSLIFocus(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bSLIFocus(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bGDIPrimary: NvU32,
        bSLIFocus: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bGDIPrimary: u32 = unsafe { ::std::mem::transmute(bGDIPrimary) };
            bGDIPrimary as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bSLIFocus: u32 = unsafe { ::std::mem::transmute(bSLIFocus) };
            bSLIFocus as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1 = _NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1;
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_DISPLAYCONFIG_PATH_INFO_V1 {
    pub version: NvU32,
    #[doc = "!< This field is reserved. There is ongoing debate if we need this field.\n!< Identifies sourceIds used by Windows. If all sourceIds are 0,\n!< these will be computed automatically."]
    pub reserved_sourceId: NvU32,
    #[doc = "!< Number of elements in targetInfo array"]
    pub targetInfoCount: NvU32,
    pub targetInfo: *mut NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1,
    #[doc = "!< May be NULL if mode info is not important"]
    pub sourceModeInfo: *mut NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1,
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_PATH_INFO_V1() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_DISPLAYCONFIG_PATH_INFO_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_PATH_INFO_V1>(),
        32usize,
        concat!("Size of: ", stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_PATH_INFO_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved_sourceId) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1),
            "::",
            stringify!(reserved_sourceId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).targetInfoCount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1),
            "::",
            stringify!(targetInfoCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).targetInfo) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1),
            "::",
            stringify!(targetInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceModeInfo) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1),
            "::",
            stringify!(sourceModeInfo)
        )
    );
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_INFO_V1 = _NV_DISPLAYCONFIG_PATH_INFO_V1;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _NV_DISPLAYCONFIG_PATH_INFO {
    pub version: NvU32,
    pub __bindgen_anon_1: _NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1,
    #[doc = "!< Number of elements in targetInfo array"]
    pub targetInfoCount: NvU32,
    pub targetInfo: *mut NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2,
    #[doc = "!< May be NULL if mode info is not important"]
    pub sourceModeInfo: *mut NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "!< Used by Non-NVIDIA adapter for pointer to OS Adapter of LUID\n!< type, type casted to void *."]
    pub pOSAdapterID: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1 {
    #[doc = "!< Identifies sourceId used by Windows CCD. This can be optionally set."]
    pub sourceId: NvU32,
    #[doc = "!< Only for compatibility"]
    pub reserved_sourceId: NvU32,
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1),
            "::",
            stringify!(sourceId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved_sourceId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1),
            "::",
            stringify!(reserved_sourceId)
        )
    );
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_PATH_INFO() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_DISPLAYCONFIG_PATH_INFO> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_PATH_INFO>(),
        48usize,
        concat!("Size of: ", stringify!(_NV_DISPLAYCONFIG_PATH_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_PATH_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_DISPLAYCONFIG_PATH_INFO))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).targetInfoCount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO),
            "::",
            stringify!(targetInfoCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).targetInfo) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO),
            "::",
            stringify!(targetInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceModeInfo) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO),
            "::",
            stringify!(sourceModeInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pOSAdapterID) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO),
            "::",
            stringify!(pOSAdapterID)
        )
    );
}
impl _NV_DISPLAYCONFIG_PATH_INFO {
    #[inline]
    pub fn IsNonNVIDIAAdapter(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_IsNonNVIDIAAdapter(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        IsNonNVIDIAAdapter: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let IsNonNVIDIAAdapter: u32 = unsafe { ::std::mem::transmute(IsNonNVIDIAAdapter) };
            IsNonNVIDIAAdapter as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_INFO_V2 = _NV_DISPLAYCONFIG_PATH_INFO;
pub type NV_DISPLAYCONFIG_PATH_INFO = NV_DISPLAYCONFIG_PATH_INFO_V2;
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_SOURCE_MODE_INFO = NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1;
pub const _NV_DISPLAYCONFIG_FLAGS_NV_DISPLAYCONFIG_VALIDATE_ONLY: _NV_DISPLAYCONFIG_FLAGS = 1;
pub const _NV_DISPLAYCONFIG_FLAGS_NV_DISPLAYCONFIG_SAVE_TO_PERSISTENCE: _NV_DISPLAYCONFIG_FLAGS = 2;
#[doc = "!< Driver reload is permitted if necessary"]
pub const _NV_DISPLAYCONFIG_FLAGS_NV_DISPLAYCONFIG_DRIVER_RELOAD_ALLOWED: _NV_DISPLAYCONFIG_FLAGS =
    4;
#[doc = "!< Refresh OS mode list."]
pub const _NV_DISPLAYCONFIG_FLAGS_NV_DISPLAYCONFIG_FORCE_MODE_ENUMERATION: _NV_DISPLAYCONFIG_FLAGS =
    8;
#[doc = "!< Tell OS to avoid optimizing CommitVidPn call during a modeset"]
pub const _NV_DISPLAYCONFIG_FLAGS_NV_FORCE_COMMIT_VIDPN: _NV_DISPLAYCONFIG_FLAGS = 16;
#[doc = "! \\ingroup dispcontrol"]
pub type _NV_DISPLAYCONFIG_FLAGS = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
pub use self::_NV_DISPLAYCONFIG_FLAGS as NV_DISPLAYCONFIG_FLAGS;
pub type NvAPI_UnicodeString = [NvU16; 2048usize];
pub type NvAPI_LPCWSTR = *const NvU16;
pub const _NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID_NVAPI_GPU_PERF_VOLTAGE_INFO_DOMAIN_CORE:
    _NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID = 0;
pub const _NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID_NVAPI_GPU_PERF_VOLTAGE_INFO_DOMAIN_UNDEFINED:
    _NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID = 16;
#[doc = "! \\ingroup gpuclock"]
pub type _NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID = ::std::os::raw::c_int;
#[doc = "! \\ingroup gpuclock"]
pub use self::_NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID as NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID;
pub const _NV_GPU_PUBLIC_CLOCK_ID_NVAPI_GPU_PUBLIC_CLOCK_GRAPHICS: _NV_GPU_PUBLIC_CLOCK_ID = 0;
pub const _NV_GPU_PUBLIC_CLOCK_ID_NVAPI_GPU_PUBLIC_CLOCK_MEMORY: _NV_GPU_PUBLIC_CLOCK_ID = 4;
pub const _NV_GPU_PUBLIC_CLOCK_ID_NVAPI_GPU_PUBLIC_CLOCK_PROCESSOR: _NV_GPU_PUBLIC_CLOCK_ID = 7;
pub const _NV_GPU_PUBLIC_CLOCK_ID_NVAPI_GPU_PUBLIC_CLOCK_VIDEO: _NV_GPU_PUBLIC_CLOCK_ID = 8;
pub const _NV_GPU_PUBLIC_CLOCK_ID_NVAPI_GPU_PUBLIC_CLOCK_UNDEFINED: _NV_GPU_PUBLIC_CLOCK_ID = 32;
#[doc = "! \\ingroup gpuclock"]
pub type _NV_GPU_PUBLIC_CLOCK_ID = ::std::os::raw::c_int;
#[doc = "! \\ingroup gpuclock"]
pub use self::_NV_GPU_PUBLIC_CLOCK_ID as NV_GPU_PUBLIC_CLOCK_ID;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P0: _NV_GPU_PERF_PSTATE_ID = 0;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P1: _NV_GPU_PERF_PSTATE_ID = 1;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P2: _NV_GPU_PERF_PSTATE_ID = 2;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P3: _NV_GPU_PERF_PSTATE_ID = 3;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P4: _NV_GPU_PERF_PSTATE_ID = 4;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P5: _NV_GPU_PERF_PSTATE_ID = 5;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P6: _NV_GPU_PERF_PSTATE_ID = 6;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P7: _NV_GPU_PERF_PSTATE_ID = 7;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P8: _NV_GPU_PERF_PSTATE_ID = 8;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P9: _NV_GPU_PERF_PSTATE_ID = 9;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P10: _NV_GPU_PERF_PSTATE_ID = 10;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P11: _NV_GPU_PERF_PSTATE_ID = 11;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P12: _NV_GPU_PERF_PSTATE_ID = 12;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P13: _NV_GPU_PERF_PSTATE_ID = 13;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P14: _NV_GPU_PERF_PSTATE_ID = 14;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P15: _NV_GPU_PERF_PSTATE_ID = 15;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_UNDEFINED: _NV_GPU_PERF_PSTATE_ID = 16;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_ALL: _NV_GPU_PERF_PSTATE_ID = 17;
#[doc = "! \\addtogroup gpupstate\n! @{"]
pub type _NV_GPU_PERF_PSTATE_ID = ::std::os::raw::c_int;
#[doc = "! \\addtogroup gpupstate\n! @{"]
pub use self::_NV_GPU_PERF_PSTATE_ID as NV_GPU_PERF_PSTATE_ID;
#[doc = "! Clock domains that use single frequency value within given pstate"]
pub const NV_GPU_PERF_PSTATE20_CLOCK_TYPE_ID_NVAPI_GPU_PERF_PSTATE20_CLOCK_TYPE_SINGLE:
    NV_GPU_PERF_PSTATE20_CLOCK_TYPE_ID = 0;
#[doc = "! Clock domains that allow range of frequency values within given pstate"]
pub const NV_GPU_PERF_PSTATE20_CLOCK_TYPE_ID_NVAPI_GPU_PERF_PSTATE20_CLOCK_TYPE_RANGE:
    NV_GPU_PERF_PSTATE20_CLOCK_TYPE_ID = 1;
#[doc = "! Used to identify clock type"]
pub type NV_GPU_PERF_PSTATE20_CLOCK_TYPE_ID = ::std::os::raw::c_int;
#[doc = "! Used to describe both voltage and frequency deltas"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_GPU_PERF_PSTATES20_PARAM_DELTA {
    #[doc = "! Value of parameter delta (in respective units [kHz, uV])"]
    pub value: NvS32,
    pub valueRange: NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1 {
    #[doc = "! Min value allowed for parameter delta (in respective units [kHz, uV])"]
    pub min: NvS32,
    #[doc = "! Max value allowed for parameter delta (in respective units [kHz, uV])"]
    pub max: NvS32,
}
#[test]
fn bindgen_test_layout_NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1),
            "::",
            stringify!(max)
        )
    );
}
#[test]
fn bindgen_test_layout_NV_GPU_PERF_PSTATES20_PARAM_DELTA() {
    const UNINIT: ::std::mem::MaybeUninit<NV_GPU_PERF_PSTATES20_PARAM_DELTA> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PERF_PSTATES20_PARAM_DELTA>(),
        12usize,
        concat!("Size of: ", stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PERF_PSTATES20_PARAM_DELTA>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).valueRange) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA),
            "::",
            stringify!(valueRange)
        )
    );
}
#[doc = "! Used to describe single clock entry"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NV_GPU_PSTATE20_CLOCK_ENTRY_V1 {
    #[doc = "! ID of the clock domain"]
    pub domainId: NV_GPU_PUBLIC_CLOCK_ID,
    #[doc = "! Clock type ID"]
    pub typeId: NV_GPU_PERF_PSTATE20_CLOCK_TYPE_ID,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "! Current frequency delta from nominal settings in (kHz)"]
    pub freqDelta_kHz: NV_GPU_PERF_PSTATES20_PARAM_DELTA,
    pub data: NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1,
}
#[doc = "! Clock domain type dependant information"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1 {
    pub single: NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1,
    pub range: NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "! Clock frequency within given pstate in (kHz)"]
    pub freq_kHz: NvU32,
}
#[test]
fn bindgen_test_layout_NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<
        NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freq_kHz) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(freq_kHz)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2 {
    #[doc = "! Min clock frequency within given pstate in (kHz)"]
    pub minFreq_kHz: NvU32,
    #[doc = "! Max clock frequency within given pstate in (kHz)"]
    pub maxFreq_kHz: NvU32,
    #[doc = "! Voltage domain ID and value range in (uV) required for this clock"]
    pub domainId: NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID,
    pub minVoltage_uV: NvU32,
    pub maxVoltage_uV: NvU32,
}
#[test]
fn bindgen_test_layout_NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<
        NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2>(),
        20usize,
        concat!(
            "Size of: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minFreq_kHz) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(minFreq_kHz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxFreq_kHz) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(maxFreq_kHz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domainId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(domainId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minVoltage_uV) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(minVoltage_uV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxVoltage_uV) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(maxVoltage_uV)
        )
    );
}
#[test]
fn bindgen_test_layout_NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1>(),
        20usize,
        concat!(
            "Size of: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).single) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1),
            "::",
            stringify!(single)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).range) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1),
            "::",
            stringify!(range)
        )
    );
}
#[test]
fn bindgen_test_layout_NV_GPU_PSTATE20_CLOCK_ENTRY_V1() {
    const UNINIT: ::std::mem::MaybeUninit<NV_GPU_PSTATE20_CLOCK_ENTRY_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1>(),
        44usize,
        concat!("Size of: ", stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domainId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1),
            "::",
            stringify!(domainId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeId) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1),
            "::",
            stringify!(typeId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freqDelta_kHz) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1),
            "::",
            stringify!(freqDelta_kHz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1),
            "::",
            stringify!(data)
        )
    );
}
impl NV_GPU_PSTATE20_CLOCK_ENTRY_V1 {
    #[inline]
    pub fn bIsEditable(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bIsEditable(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bIsEditable: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bIsEditable: u32 = unsafe { ::std::mem::transmute(bIsEditable) };
            bIsEditable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! Used to describe single base voltage entry"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1 {
    #[doc = "! ID of the voltage domain"]
    pub domainId: NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "! Current base voltage settings in [uV]"]
    pub volt_uV: NvU32,
    pub voltDelta_uV: NV_GPU_PERF_PSTATES20_PARAM_DELTA,
}
#[test]
fn bindgen_test_layout_NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1() {
    const UNINIT: ::std::mem::MaybeUninit<NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domainId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1),
            "::",
            stringify!(domainId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).volt_uV) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1),
            "::",
            stringify!(volt_uV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).voltDelta_uV) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1),
            "::",
            stringify!(voltDelta_uV)
        )
    );
}
impl NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1 {
    #[inline]
    pub fn bIsEditable(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bIsEditable(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bIsEditable: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bIsEditable: u32 = unsafe { ::std::mem::transmute(bIsEditable) };
            bIsEditable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! Used in NvAPI_GPU_GetPstates20() interface call."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NV_GPU_PERF_PSTATES20_INFO_V1 {
    #[doc = "! Version info of the structure (NV_GPU_PERF_PSTATES20_INFO_VER<n>)"]
    pub version: NvU32,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "! Number of populated pstates"]
    pub numPstates: NvU32,
    #[doc = "! Number of populated clocks (per pstate)"]
    pub numClocks: NvU32,
    #[doc = "! Number of populated base voltages (per pstate)"]
    pub numBaseVoltages: NvU32,
    pub pstates: [NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1; 16usize],
}
#[doc = "! Performance state (P-State) settings\n! Valid index range is 0 to numPstates-1"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1 {
    #[doc = "! ID of the P-State"]
    pub pstateId: NV_GPU_PERF_PSTATE_ID,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "! Array of clock entries\n! Valid index range is 0 to numClocks-1"]
    pub clocks: [NV_GPU_PSTATE20_CLOCK_ENTRY_V1; 8usize],
    #[doc = "! Array of baseVoltage entries\n! Valid index range is 0 to numBaseVoltages-1"]
    pub baseVoltages: [NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1; 4usize],
}
#[test]
fn bindgen_test_layout_NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1>(),
        456usize,
        concat!(
            "Size of: ",
            stringify!(NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pstateId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1),
            "::",
            stringify!(pstateId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clocks) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1),
            "::",
            stringify!(clocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseVoltages) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1),
            "::",
            stringify!(baseVoltages)
        )
    );
}
impl NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1 {
    #[inline]
    pub fn bIsEditable(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bIsEditable(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bIsEditable: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bIsEditable: u32 = unsafe { ::std::mem::transmute(bIsEditable) };
            bIsEditable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_NV_GPU_PERF_PSTATES20_INFO_V1() {
    const UNINIT: ::std::mem::MaybeUninit<NV_GPU_PERF_PSTATES20_INFO_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PERF_PSTATES20_INFO_V1>(),
        7316usize,
        concat!("Size of: ", stringify!(NV_GPU_PERF_PSTATES20_INFO_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PERF_PSTATES20_INFO_V1>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_GPU_PERF_PSTATES20_INFO_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PERF_PSTATES20_INFO_V1),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numPstates) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PERF_PSTATES20_INFO_V1),
            "::",
            stringify!(numPstates)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numClocks) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PERF_PSTATES20_INFO_V1),
            "::",
            stringify!(numClocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numBaseVoltages) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PERF_PSTATES20_INFO_V1),
            "::",
            stringify!(numBaseVoltages)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pstates) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_PERF_PSTATES20_INFO_V1),
            "::",
            stringify!(pstates)
        )
    );
}
impl NV_GPU_PERF_PSTATES20_INFO_V1 {
    #[inline]
    pub fn bIsEditable(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bIsEditable(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bIsEditable: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bIsEditable: u32 = unsafe { ::std::mem::transmute(bIsEditable) };
            bIsEditable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! Used in NvAPI_GPU_GetPstates20() interface call."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _NV_GPU_PERF_PSTATES20_INFO_V2 {
    #[doc = "! Version info of the structure (NV_GPU_PERF_PSTATES20_INFO_VER<n>)"]
    pub version: NvU32,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "! Number of populated pstates"]
    pub numPstates: NvU32,
    #[doc = "! Number of populated clocks (per pstate)"]
    pub numClocks: NvU32,
    #[doc = "! Number of populated base voltages (per pstate)"]
    pub numBaseVoltages: NvU32,
    pub pstates: [_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1; 16usize],
    pub ov: _NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2,
}
#[doc = "! Performance state (P-State) settings\n! Valid index range is 0 to numPstates-1"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1 {
    #[doc = "! ID of the P-State"]
    pub pstateId: NV_GPU_PERF_PSTATE_ID,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "! Array of clock entries\n! Valid index range is 0 to numClocks-1"]
    pub clocks: [NV_GPU_PSTATE20_CLOCK_ENTRY_V1; 8usize],
    #[doc = "! Array of baseVoltage entries\n! Valid index range is 0 to numBaseVoltages-1"]
    pub baseVoltages: [NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1; 4usize],
}
#[test]
fn bindgen_test_layout__NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1>(),
        456usize,
        concat!(
            "Size of: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pstateId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1),
            "::",
            stringify!(pstateId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clocks) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1),
            "::",
            stringify!(clocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseVoltages) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1),
            "::",
            stringify!(baseVoltages)
        )
    );
}
impl _NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1 {
    #[inline]
    pub fn bIsEditable(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bIsEditable(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bIsEditable: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bIsEditable: u32 = unsafe { ::std::mem::transmute(bIsEditable) };
            bIsEditable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! OV settings - Please refer to NVIDIA over-volting recommendation to understand impact of this functionality\n! Valid index range is 0 to numVoltages-1"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2 {
    #[doc = "! Number of populated voltages"]
    pub numVoltages: NvU32,
    #[doc = "! Array of voltage entries\n! Valid index range is 0 to numVoltages-1"]
    pub voltages: [NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1; 4usize],
}
#[test]
fn bindgen_test_layout__NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2>(),
        100usize,
        concat!(
            "Size of: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numVoltages) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2),
            "::",
            stringify!(numVoltages)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).voltages) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2),
            "::",
            stringify!(voltages)
        )
    );
}
#[test]
fn bindgen_test_layout__NV_GPU_PERF_PSTATES20_INFO_V2() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_GPU_PERF_PSTATES20_INFO_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_GPU_PERF_PSTATES20_INFO_V2>(),
        7416usize,
        concat!("Size of: ", stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_GPU_PERF_PSTATES20_INFO_V2>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numPstates) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2),
            "::",
            stringify!(numPstates)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numClocks) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2),
            "::",
            stringify!(numClocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numBaseVoltages) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2),
            "::",
            stringify!(numBaseVoltages)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pstates) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2),
            "::",
            stringify!(pstates)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ov) as usize - ptr as usize },
        7316usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2),
            "::",
            stringify!(ov)
        )
    );
}
impl _NV_GPU_PERF_PSTATES20_INFO_V2 {
    #[inline]
    pub fn bIsEditable(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bIsEditable(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bIsEditable: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bIsEditable: u32 = unsafe { ::std::mem::transmute(bIsEditable) };
            bIsEditable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! Used in NvAPI_GPU_GetPstates20() interface call."]
pub type NV_GPU_PERF_PSTATES20_INFO_V2 = _NV_GPU_PERF_PSTATES20_INFO_V2;
#[doc = "! Used in NvAPI_GPU_GetPstates20() interface call."]
pub type NV_GPU_PERF_PSTATES20_INFO = NV_GPU_PERF_PSTATES20_INFO_V2;
#[doc = "! \\ingroup driverapi\n! Used in NvAPI_GetDisplayDriverVersion()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_DISPLAY_DRIVER_VERSION {
    pub version: NvU32,
    pub drvVersion: NvU32,
    pub bldChangeListNum: NvU32,
    pub szBuildBranchString: NvAPI_ShortString,
    pub szAdapterString: NvAPI_ShortString,
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_DRIVER_VERSION() {
    const UNINIT: ::std::mem::MaybeUninit<NV_DISPLAY_DRIVER_VERSION> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_DRIVER_VERSION>(),
        140usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_DRIVER_VERSION))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_DRIVER_VERSION>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_DISPLAY_DRIVER_VERSION))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_VERSION),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).drvVersion) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_VERSION),
            "::",
            stringify!(drvVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bldChangeListNum) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_VERSION),
            "::",
            stringify!(bldChangeListNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).szBuildBranchString) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_VERSION),
            "::",
            stringify!(szBuildBranchString)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).szAdapterString) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_DISPLAY_DRIVER_VERSION),
            "::",
            stringify!(szAdapterString)
        )
    );
}
extern "C" {
    #[doc = "! \\ingroup driverapi"]
    pub fn NvAPI_GetDisplayDriverVersion(
        hNvDisplay: NvDisplayHandle,
        pVersion: *mut NV_DISPLAY_DRIVER_VERSION,
    ) -> NvAPI_Status;
}
#[doc = "!   DESCRIPTION: Used in conjunction with OUTPUT_TO_CALLBACK, this is a simple\n!                callback function the user may use to obtain the feedback\n!                stream. The function will be called once per fully qualified\n!                feedback stream entry.\n!\n!   \\param   categoryId    Contains the bit from the NVAPI_OGLEXPERT_REPORT\n!                          mask that corresponds to the current message\n!   \\param   messageId     Unique ID for the current message\n!   \\param   detailLevel   Contains the bit from the NVAPI_OGLEXPERT_DETAIL\n!                          mask that corresponds to the current message\n!   \\param   objectId      Unique ID of the object that corresponds to the\n!                          current message\n!   \\param   messageStr    Text string from the current message\n!\n!   \\ingroup oglapi\n"]
pub type NVAPI_OGLEXPERT_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        categoryId: ::std::os::raw::c_uint,
        messageId: ::std::os::raw::c_uint,
        detailLevel: ::std::os::raw::c_uint,
        objectId: ::std::os::raw::c_int,
        messageStr: *const ::std::os::raw::c_char,
    ),
>;
extern "C" {
    #[doc = "! \\ingroup oglapi\n! SUPPORTED OS:  Windows 7 and higher\n!"]
    pub fn NvAPI_OGL_ExpertModeSet(
        expertDetailLevel: NvU32,
        expertReportMask: NvU32,
        expertOutputMask: NvU32,
        expertCallback: NVAPI_OGLEXPERT_CALLBACK,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! \\addtogroup oglapi\n! SUPPORTED OS:  Windows 7 and higher\n!"]
    pub fn NvAPI_OGL_ExpertModeGet(
        pExpertDetailLevel: *mut NvU32,
        pExpertReportMask: *mut NvU32,
        pExpertOutputMask: *mut NvU32,
        pExpertCallback: *mut NVAPI_OGLEXPERT_CALLBACK,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! \\ingroup oglapi\n! SUPPORTED OS:  Windows 7 and higher\n!"]
    pub fn NvAPI_OGL_ExpertModeDefaultsSet(
        expertDetailLevel: NvU32,
        expertReportMask: NvU32,
        expertOutputMask: NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! \\addtogroup oglapi\n! SUPPORTED OS:  Windows 7 and higher\n!"]
    pub fn NvAPI_OGL_ExpertModeDefaultsGet(
        pExpertDetailLevel: *mut NvU32,
        pExpertReportMask: *mut NvU32,
        pExpertOutputMask: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns an array of physical GPU handles that are in TCC Mode.\n! Each handle represents a physical GPU present in the system in TCC Mode.\n! That GPU may not be visible to the OS directly.\n!\n! The array nvGPUHandle will be filled with physical GPU handle values. The returned\n! gpuCount determines how many entries in the array are valid.\n!\n! NOTE: Handles enumerated by this API are only valid for NvAPIs that are tagged as TCC_SUPPORTED\n!       If handle is passed to any other API, it will fail with NVAPI_INVALID_HANDLE\n!\n!       For WDDM GPU handles please use NvAPI_EnumPhysicalGPUs()\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n!\n! \\param [out]   nvGPUHandle      Physical GPU array that will contain all TCC Physical GPUs\n! \\param [out]   pGpuCount        count represent the number of valid entries in nvGPUHandle\n!\n!\n! \\retval NVAPI_INVALID_ARGUMENT         nvGPUHandle or pGpuCount is NULL\n! \\ingroup gpu\n"]
    pub fn NvAPI_EnumTCCPhysicalGPUs(
        nvGPUHandle: *mut NvPhysicalGpuHandle,
        pGpuCount: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns an array of logical GPU handles.\n!\n! Each handle represents one or more GPUs acting in concert as a single graphics device.\n!\n! At least one GPU must be present in the system and running an NVIDIA display driver.\n!\n! The array nvGPUHandle will be filled with logical GPU handle values.  The returned\n! gpuCount determines how many entries in the array are valid.\n!\n! \\note All logical GPUs handles get invalidated on a GPU topology change, so the calling\n!       application is required to renum the logical GPU handles to get latest physical handle\n!       mapping after every GPU topology change activated by a call to NvAPI_SetGpuTopologies().\n!\n! To detect if SLI rendering is enabled, use NvAPI_D3D_GetCurrentSLIState().\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 80\n!\n! \\retval NVAPI_INVALID_ARGUMENT         nvGPUHandle or pGpuCount is NULL\n! \\retval NVAPI_OK                       One or more handles were returned\n! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  No NVIDIA GPU driving a display was found\n! \\ingroup gpu\n"]
    pub fn NvAPI_EnumLogicalGPUs(
        nvGPUHandle: *mut NvLogicalGpuHandle,
        pGpuCount: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns an array of physical GPU handles associated with the specified display.\n!\n! At least one GPU must be present in the system and running an NVIDIA display driver.\n!\n! The array nvGPUHandle will be filled with physical GPU handle values.  The returned\n! gpuCount determines how many entries in the array are valid.\n!\n! If the display corresponds to more than one physical GPU, the first GPU returned\n! is the one with the attached active output.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 80\n!\n! \\retval NVAPI_INVALID_ARGUMENT         hNvDisp is not valid; nvGPUHandle or pGpuCount is NULL\n! \\retval NVAPI_OK                       One or more handles were returned\n! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  no NVIDIA GPU driving a display was found\n! \\ingroup gpu\n"]
    pub fn NvAPI_GetPhysicalGPUsFromDisplay(
        hNvDisp: NvDisplayHandle,
        nvGPUHandle: *mut NvPhysicalGpuHandle,
        pGpuCount: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns a physical GPU handle associated with the specified unattached display.\n! The source GPU is a physical render GPU which renders the frame buffer but may or may not drive the scan out.\n!\n! At least one GPU must be present in the system and running an NVIDIA display driver.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 80\n!\n! \\retval NVAPI_INVALID_ARGUMENT         hNvUnAttachedDisp is not valid or pPhysicalGpu is NULL.\n! \\retval NVAPI_OK                       One or more handles were returned\n! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  No NVIDIA GPU driving a display was found\n! \\ingroup gpu\n"]
    pub fn NvAPI_GetPhysicalGPUFromUnAttachedDisplay(
        hNvUnAttachedDisp: NvUnAttachedDisplayHandle,
        pPhysicalGpu: *mut NvPhysicalGpuHandle,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns the logical GPU handle associated with the specified display.\n! At least one GPU must be present in the system and running an NVIDIA display driver.\n! hNvDisp can be NVAPI_DEFAULT_HANDLE or a handle enumerated from NvAPI_EnumNVidiaDisplayHandle().\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 80\n!\n! \\retval NVAPI_INVALID_ARGUMENT         hNvDisp is not valid; pLogicalGPU is NULL\n! \\retval NVAPI_OK                       One or more handles were returned\n! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  No NVIDIA GPU driving a display was found\n! \\ingroup gpu\n"]
    pub fn NvAPI_GetLogicalGPUFromDisplay(
        hNvDisp: NvDisplayHandle,
        pLogicalGPU: *mut NvLogicalGpuHandle,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns the logical GPU handle associated with specified physical GPU handle.\n! At least one GPU must be present in the system and running an NVIDIA display driver.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 80\n!\n! \\retval NVAPI_INVALID_ARGUMENT         hPhysicalGPU is not valid; pLogicalGPU is NULL\n! \\retval NVAPI_OK                       One or more handles were returned\n! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  No NVIDIA GPU driving a display was found\n! \\ingroup gpu\n"]
    pub fn NvAPI_GetLogicalGPUFromPhysicalGPU(
        hPhysicalGPU: NvPhysicalGpuHandle,
        pLogicalGPU: *mut NvLogicalGpuHandle,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns the physical GPU handles associated with the specified logical GPU handle.\n!  At least one GPU must be present in the system and running an NVIDIA display driver.\n!\n!  The array hPhysicalGPU will be filled with physical GPU handle values.  The returned\n!  gpuCount determines how many entries in the array are valid.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 80\n!\n! \\retval NVAPI_INVALID_ARGUMENT             hLogicalGPU is not valid; hPhysicalGPU is NULL\n! \\retval NVAPI_OK                           One or more handles were returned\n! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND      No NVIDIA GPU driving a display was found\n! \\retval NVAPI_EXPECTED_LOGICAL_GPU_HANDLE  hLogicalGPU was not a logical GPU handle\n! \\ingroup gpu\n"]
    pub fn NvAPI_GetPhysicalGPUsFromLogicalGPU(
        hLogicalGPU: NvLogicalGpuHandle,
        hPhysicalGPU: *mut NvPhysicalGpuHandle,
        pGpuCount: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  Do not use this function for new software development.\n!\n! SUPPORTED OS:  Windows 10 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 80\n!\n! \\retval NVAPI_INVALID_ARGUMENT         gpuId is zero or pPhysicalGPU is NULL\n! \\retval NVAPI_OK                       Handle was returned\n! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  No NVIDIA GPU driving a display was found\n! \\ingroup gpu\n"]
    pub fn NvAPI_GetPhysicalGPUFromGPUID(
        gpuId: NvU32,
        pPhysicalGPU: *mut NvPhysicalGpuHandle,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! SUPPORTED OS:  Windows 10 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 95\n!\n! \\retval NVAPI_INVALID_ARGUMENT         hPhysicalGpu is NULL or invalid. Re-enumerate the GPU handles.\n! \\retval NVAPI_OK                       Handle was returned\n! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  No NVIDIA GPU driving a display was found\n! \\ingroup gpu\n"]
    pub fn NvAPI_GetGPUIDfromPhysicalGPU(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pGpuId: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!   DESCRIPTION: This function retrieves the number of Shader SubPipes on the GPU\n!                On newer architectures, this corresponds to the number of SM units\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 170\n!\n! \\retval NVAPI_INVALID_ARGUMENT: pCount is NULL\n! \\retval NVAPI_OK: *pCount is set\n! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND: no NVIDIA GPU driving a display was found\n! \\retval NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE: hPhysicalGpu was not a physical GPU handle\n!\n! \\ingroup   gpu\n"]
    pub fn NvAPI_GPU_GetShaderSubPipeCount(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pCount: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!   DESCRIPTION: Retrieves the total number of cores defined for a GPU.\n!                Returns 0 on architectures that don't define GPU cores.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\retval ::NVAPI_INVALID_ARGUMENT              pCount is NULL\n! \\retval ::NVAPI_OK                            *pCount is set\n! \\retval ::NVAPI_NVIDIA_DEVICE_NOT_FOUND       no NVIDIA GPU driving a display was found\n! \\retval ::NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle\n! \\retval ::NVAPI_NOT_SUPPORTED                 API call is not supported on current architecture\n!\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetGpuCoreCount(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pCount: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns set of all GPU-output identifiers as a bitmask.\n!\n! \\deprecated  Do not use this function - it is deprecated in release 290. Instead, use NvAPI_GPU_GetAllDisplayIds.\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 85\n!\n! \\retval   NVAPI_INVALID_ARGUMENT              hPhysicalGpu or pOutputsMask is NULL.\n! \\retval   NVAPI_OK                           *pOutputsMask contains a set of GPU-output identifiers.\n! \\retval   NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found.\n! \\retval   NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle.\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetAllOutputs(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pOutputsMask: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function is the same as NvAPI_GPU_GetAllOutputs() but returns only the set of GPU output\n! identifiers that are connected to display devices.\n!\n! \\deprecated  Do not use this function - it is deprecated in release 290. Instead, use NvAPI_GPU_GetConnectedDisplayIds.\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 80\n!\n! \\retval   NVAPI_INVALID_ARGUMENT              hPhysicalGpu or pOutputsMask is NULL.\n! \\retval   NVAPI_OK                           *pOutputsMask contains a set of GPU-output identifiers.\n! \\retval   NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found.\n! \\retval   NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle.\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetConnectedOutputs(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pOutputsMask: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!   DESCRIPTION: This function is the same as NvAPI_GPU_GetConnectedOutputs() but returns only the set of GPU-output\n!                identifiers that can be selected in an SLI configuration.\n!                 NOTE: This function matches NvAPI_GPU_GetConnectedOutputs()\n!                 - On systems which are not SLI capable.\n!                 - If the queried GPU is not part of a valid SLI group.\n!\n! \\deprecated  Do not use this function - it is deprecated in release 290. Instead, use NvAPI_GPU_GetConnectedDisplayIds.\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 170\n!\n! \\retval   NVAPI_INVALID_ARGUMENT              hPhysicalGpu or pOutputsMask is NULL\n! \\retval   NVAPI_OK                           *pOutputsMask contains a set of GPU-output identifiers\n! \\retval   NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found\n! \\retval   NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE: hPhysicalGpu was not a physical GPU handle\n!\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetConnectedSLIOutputs(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pOutputsMask: *mut NvU32,
    ) -> NvAPI_Status;
}
pub const NV_MONITOR_CONN_TYPE_NV_MONITOR_CONN_TYPE_UNINITIALIZED: NV_MONITOR_CONN_TYPE = 0;
pub const NV_MONITOR_CONN_TYPE_NV_MONITOR_CONN_TYPE_VGA: NV_MONITOR_CONN_TYPE = 1;
pub const NV_MONITOR_CONN_TYPE_NV_MONITOR_CONN_TYPE_COMPONENT: NV_MONITOR_CONN_TYPE = 2;
pub const NV_MONITOR_CONN_TYPE_NV_MONITOR_CONN_TYPE_SVIDEO: NV_MONITOR_CONN_TYPE = 3;
pub const NV_MONITOR_CONN_TYPE_NV_MONITOR_CONN_TYPE_HDMI: NV_MONITOR_CONN_TYPE = 4;
pub const NV_MONITOR_CONN_TYPE_NV_MONITOR_CONN_TYPE_DVI: NV_MONITOR_CONN_TYPE = 5;
pub const NV_MONITOR_CONN_TYPE_NV_MONITOR_CONN_TYPE_LVDS: NV_MONITOR_CONN_TYPE = 6;
pub const NV_MONITOR_CONN_TYPE_NV_MONITOR_CONN_TYPE_DP: NV_MONITOR_CONN_TYPE = 7;
pub const NV_MONITOR_CONN_TYPE_NV_MONITOR_CONN_TYPE_COMPOSITE: NV_MONITOR_CONN_TYPE = 8;
pub const NV_MONITOR_CONN_TYPE_NV_MONITOR_CONN_TYPE_UNKNOWN: NV_MONITOR_CONN_TYPE = -1;
#[doc = "! \\ingroup gpu"]
pub type NV_MONITOR_CONN_TYPE = ::std::os::raw::c_int;
#[doc = "! \\ingroup gpu"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_GPU_DISPLAYIDS {
    pub version: NvU32,
    #[doc = "!< out: vga, tv, dvi, hdmi and dp. This is reserved for future use and clients should not rely on this information. Instead get the\n!< GPU connector type from NvAPI_GPU_GetConnectorInfo/NvAPI_GPU_GetConnectorInfoEx"]
    pub connectorType: NV_MONITOR_CONN_TYPE,
    #[doc = "!< this is a unique identifier for each device"]
    pub displayId: NvU32,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__NV_GPU_DISPLAYIDS() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_GPU_DISPLAYIDS> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_GPU_DISPLAYIDS>(),
        16usize,
        concat!("Size of: ", stringify!(_NV_GPU_DISPLAYIDS))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_GPU_DISPLAYIDS>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_GPU_DISPLAYIDS))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_DISPLAYIDS),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connectorType) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_DISPLAYIDS),
            "::",
            stringify!(connectorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).displayId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_GPU_DISPLAYIDS),
            "::",
            stringify!(displayId)
        )
    );
}
impl _NV_GPU_DISPLAYIDS {
    #[inline]
    pub fn isDynamic(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isDynamic(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isMultiStreamRootNode(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isMultiStreamRootNode(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isActive(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isActive(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isCluster(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isCluster(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isOSVisible(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isOSVisible(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isWFD(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isWFD(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isConnected(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isConnected(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reservedInternal(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 10u8) as u32) }
    }
    #[inline]
    pub fn set_reservedInternal(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn isPhysicallyConnected(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isPhysicallyConnected(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 14u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 14u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        isDynamic: NvU32,
        isMultiStreamRootNode: NvU32,
        isActive: NvU32,
        isCluster: NvU32,
        isOSVisible: NvU32,
        isWFD: NvU32,
        isConnected: NvU32,
        reservedInternal: NvU32,
        isPhysicallyConnected: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let isDynamic: u32 = unsafe { ::std::mem::transmute(isDynamic) };
            isDynamic as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let isMultiStreamRootNode: u32 =
                unsafe { ::std::mem::transmute(isMultiStreamRootNode) };
            isMultiStreamRootNode as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let isActive: u32 = unsafe { ::std::mem::transmute(isActive) };
            isActive as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let isCluster: u32 = unsafe { ::std::mem::transmute(isCluster) };
            isCluster as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let isOSVisible: u32 = unsafe { ::std::mem::transmute(isOSVisible) };
            isOSVisible as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let isWFD: u32 = unsafe { ::std::mem::transmute(isWFD) };
            isWFD as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let isConnected: u32 = unsafe { ::std::mem::transmute(isConnected) };
            isConnected as u64
        });
        __bindgen_bitfield_unit.set(7usize, 10u8, {
            let reservedInternal: u32 = unsafe { ::std::mem::transmute(reservedInternal) };
            reservedInternal as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let isPhysicallyConnected: u32 =
                unsafe { ::std::mem::transmute(isPhysicallyConnected) };
            isPhysicallyConnected as u64
        });
        __bindgen_bitfield_unit.set(18usize, 14u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! \\ingroup gpu"]
pub type NV_GPU_DISPLAYIDS = _NV_GPU_DISPLAYIDS;
extern "C" {
    #[doc = "!\n!   DESCRIPTION: Due to space limitation NvAPI_GPU_GetConnectedOutputs can return maximum 32 devices, but\n!                this is no longer true for DPMST. NvAPI_GPU_GetConnectedDisplayIds will return all\n!                the connected display devices in the form of displayIds for the associated hPhysicalGpu.\n!                This function can accept set of flags to request cached, uncached, sli and lid to get the connected devices.\n!                Default value for flags will be cached .\n!\n! HOW TO USE: 1) for each PhysicalGpu, make a call to get the number of connected displayId's\n!                using NvAPI_GPU_GetConnectedDisplayIds by passing the pDisplayIds as NULL\n!                On call success:\n!\n!             2) If pDisplayIdCount is greater than 0, allocate memory based on pDisplayIdCount. Then make a call NvAPI_GPU_GetConnectedDisplayIds to populate DisplayIds.\n!                However, if pDisplayIdCount is 0, do not make this call.\n! SUPPORTED OS:  Windows 7 and higher\n!\n! \\param [in]     hPhysicalGpu   - GPU selection\n! \\param [in]     flags          - One or more defines from NV_GPU_CONNECTED_IDS_FLAG_* as valid flags.\n! \\param [in,out]     pDisplayIds   - Pointer to an NV_GPU_DISPLAYIDS struct, each entry represents a one displayID and its attributes\n! \\param [in]     pDisplayIdCount - Number of displayId's.\n!\n! \\retval  NVAPI_INVALID_ARGUMENT: hPhysicalGpu or pDisplayIds or pDisplayIdCount is NULL\n! \\retval  NVAPI_OK: *pDisplayIds contains a set of GPU-output identifiers\n! \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND: no NVIDIA GPU driving a display was found\n! \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE: hPhysicalGpu was not a physical GPU handle\n!\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetConnectedDisplayIds(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pDisplayIds: *mut NV_GPU_DISPLAYIDS,
        pDisplayIdCount: *mut NvU32,
        flags: NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!   DESCRIPTION: This API returns display IDs for all possible outputs on the GPU.\n!                For DPMST connector, it will return display IDs for all the video sinks in the topology. \\n\n! HOW TO USE: 1. The first call should be made to get the all display ID count. To get the display ID count, send in \\n\n!                  a) hPhysicalGpu    - a valid GPU handle(enumerated using NvAPI_EnumPhysicalGPUs()) as input,      \\n\n!                  b) pDisplayIds     - NULL, as we just want to get the display ID count.                           \\n\n!                  c) pDisplayIdCount - a valid pointer to NvU32, whose value is set to ZERO.                        \\n\n!                If all parameters are correct and this call is successful, this call will return the display ID's count. \\n\n!             2. To get the display ID array, make the second call to NvAPI_GPU_GetAllDisplayIds() with              \\n\n!                  a) hPhysicalGpu    - should be same value which was sent in first call,                           \\n\n!                  b) pDisplayIds     - pointer to the display ID array allocated by caller based on display ID count,    \\n\n!                                       eg. malloc(sizeof(NV_GPU_DISPLAYIDS) * pDisplayIdCount).                     \\n\n!                  c) pDisplayIdCount - a valid pointer to NvU32. This indicates for how many display IDs            \\n\n!                                       the memory is allocated(pDisplayIds) by the caller.                          \\n\n!                If all parameters are correct and this call is successful, this call will return the display ID array and actual\n!                display ID count (which was obtained in the first call to NvAPI_GPU_GetAllDisplayIds). If the input display ID count is\n!                less than the actual display ID count, it will overwrite the input and give the pDisplayIdCount as actual count and the\n!                API will return NVAPI_INSUFFICIENT_BUFFER.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\param [in]     hPhysicalGpu         GPU selection.\n! \\param [in,out] DisplayIds           Pointer to an array of NV_GPU_DISPLAYIDS structures, each entry represents one displayID\n!                                      and its attributes.\n! \\param [in,out] pDisplayIdCount      As input, this parameter indicates the number of display's id's for which caller has\n!                                      allocated the memory. As output, it will return the actual number of display IDs.\n!\n! \\return  This API can return any of the error codes enumerated in #NvAPI_Status. If there are return error codes with\n!          specific meaning for this API, they are listed below.\n!\n! \\retval  NVAPI_INSUFFICIENT_BUFFER  When the input buffer(pDisplayIds) is less than the actual number of display IDs, this API\n!                                     will return NVAPI_INSUFFICIENT_BUFFER.\n!\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetAllDisplayIds(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pDisplayIds: *mut NV_GPU_DISPLAYIDS,
        pDisplayIdCount: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function is similar to NvAPI_GPU_GetConnectedOutputs(), and returns the connected display identifiers that are connected\n!  as an output mask but unlike NvAPI_GPU_GetConnectedOutputs() this API \"always\" reflects the Lid State in the output mask.\n!  Thus if you expect the LID close state to be available in the connection mask use this API.\n!  - If LID is closed then this API will remove the LID panel from the connected display identifiers.\n!  - If LID is open then this API will reflect the LID panel in the connected display identifiers.\n!\n! \\note This API should be used on notebook systems and on systems where the LID state is required in the connection\n!       output mask. On desktop systems the returned identifiers will match NvAPI_GPU_GetConnectedOutputs().\n!\n! \\deprecated  Do not use this function - it is deprecated in release 290. Instead, use NvAPI_GPU_GetConnectedDisplayIds.\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 95\n!\n! \\retval  NVAPI_INVALID_ARGUMENT              hPhysicalGpu or pOutputsMask is NULL\n! \\retval  NVAPI_OK                           *pOutputsMask contains a set of GPU-output identifiers\n! \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found\n! \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetConnectedOutputsWithLidState(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pOutputsMask: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!   DESCRIPTION: This function is the same as NvAPI_GPU_GetConnectedOutputsWithLidState() but returns only the set\n!                of GPU-output identifiers that can be selected in an SLI configuration. With SLI disabled,\n!                this function matches NvAPI_GPU_GetConnectedOutputsWithLidState().\n!\n! \\deprecated  Do not use this function - it is deprecated in release 290. Instead, use NvAPI_GPU_GetConnectedDisplayIds.\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 170\n!\n! \\retval  NVAPI_INVALID_ARGUMENT              hPhysicalGpu or pOutputsMask is NULL\n! \\retval  NVAPI_OK                           *pOutputsMask contains a set of GPU-output identifiers\n! \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found\n! \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle\n!\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetConnectedSLIOutputsWithLidState(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pOutputsMask: *mut NvU32,
    ) -> NvAPI_Status;
}
pub const NV_SYSTEM_TYPE_NV_SYSTEM_TYPE_UNKNOWN: NV_SYSTEM_TYPE = 0;
pub const NV_SYSTEM_TYPE_NV_SYSTEM_TYPE_LAPTOP: NV_SYSTEM_TYPE = 1;
pub const NV_SYSTEM_TYPE_NV_SYSTEM_TYPE_DESKTOP: NV_SYSTEM_TYPE = 2;
#[doc = "! \\ingroup gpu\n! Used in NvAPI_GPU_GetSystemType()"]
pub type NV_SYSTEM_TYPE = ::std::os::raw::c_int;
extern "C" {
    #[doc = "! \\ingroup gpu"]
    pub fn NvAPI_GPU_GetSystemType(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pSystemType: *mut NV_SYSTEM_TYPE,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function is the same as NvAPI_GPU_GetAllOutputs but returns only the set of GPU output\n!  identifiers that are actively driving display devices.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 85\n!\n! \\retval    NVAPI_INVALID_ARGUMENT              hPhysicalGpu or pOutputsMask is NULL.\n! \\retval    NVAPI_OK                           *pOutputsMask contains a set of GPU-output identifiers.\n! \\retval    NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found.\n! \\retval    NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle.\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetActiveOutputs(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pOutputsMask: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  Thus function sets the EDID data for the specified GPU handle and connection bit mask.\n!  User can either send (Gpu handle & output id)  or only display Id in variable displayOutputId parameter & hPhysicalGpu parameter can be default handle (0).\n!  \\note The EDID will be cached across the boot session and will be enumerated to the OS in this call.\n!        To remove the EDID set sizeofEDID to zero.\n!        OS and NVAPI connection status APIs will reflect the newly set or removed EDID dynamically.\n!\n!                This feature will NOT be supported on the following boards:\n!                - GeForce\n!                - Quadro VX\n!                - Tesla\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 100\n!\n! \\retval  NVAPI_INVALID_ARGUMENT              pEDID is NULL; displayOutputId has 0 or > 1 bits set\n! \\retval  NVAPI_OK                           *pEDID data was applied to the requested displayOutputId.\n! \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found.\n! \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE: hPhysicalGpu was not a physical GPU handle.\n! \\retval  NVAPI_NOT_SUPPORTED                 For the above mentioned GPUs\n! \\retval  NVAPI_INVALID_USER_PRIVILEGE        The application will require Administrator privileges to access this API.\n!                                              The application can be elevated to a higher permission level by selecting \"Run as Administrator\".\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_SetEDID(
        hPhysicalGpu: NvPhysicalGpuHandle,
        displayOutputId: NvU32,
        pEDID: *mut NV_EDID,
    ) -> NvAPI_Status;
}
pub const _NV_GPU_OUTPUT_TYPE_NVAPI_GPU_OUTPUT_UNKNOWN: _NV_GPU_OUTPUT_TYPE = 0;
#[doc = "!<  CRT display device"]
pub const _NV_GPU_OUTPUT_TYPE_NVAPI_GPU_OUTPUT_CRT: _NV_GPU_OUTPUT_TYPE = 1;
#[doc = "!<  Digital Flat Panel display device"]
pub const _NV_GPU_OUTPUT_TYPE_NVAPI_GPU_OUTPUT_DFP: _NV_GPU_OUTPUT_TYPE = 2;
#[doc = "!<  TV display device"]
pub const _NV_GPU_OUTPUT_TYPE_NVAPI_GPU_OUTPUT_TV: _NV_GPU_OUTPUT_TYPE = 3;
#[doc = "! \\ingroup gpu\n! used in NvAPI_GPU_GetOutputType()"]
pub type _NV_GPU_OUTPUT_TYPE = ::std::os::raw::c_int;
#[doc = "! \\ingroup gpu\n! used in NvAPI_GPU_GetOutputType()"]
pub use self::_NV_GPU_OUTPUT_TYPE as NV_GPU_OUTPUT_TYPE;
extern "C" {
    #[doc = "! \\ingroup gpu"]
    pub fn NvAPI_GPU_GetOutputType(
        hPhysicalGpu: NvPhysicalGpuHandle,
        outputId: NvU32,
        pOutputType: *mut NV_GPU_OUTPUT_TYPE,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function determines if a set of GPU outputs can be active\n!  simultaneously.  While a GPU may have <n> outputs, typically they cannot\n!  all be active at the same time due to internal resource sharing.\n!\n!  Given a physical GPU handle and a mask of candidate outputs, this call\n!  will return NVAPI_OK if all of the specified outputs can be driven\n!  simultaneously.  It will return NVAPI_INVALID_COMBINATION if they cannot.\n!\n!  Use NvAPI_GPU_GetAllOutputs() to determine which outputs are candidates.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 85\n!\n! \\retval  NVAPI_OK                            Combination of outputs in outputsMask are valid (can be active simultaneously).\n! \\retval  NVAPI_INVALID_COMBINATION           Combination of outputs in outputsMask are NOT valid.\n! \\retval  NVAPI_INVALID_ARGUMENT              hPhysicalGpu or outputsMask does not have at least 2 bits set.\n! \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle.\n! \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found.\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_ValidateOutputCombination(
        hPhysicalGpu: NvPhysicalGpuHandle,
        outputsMask: NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function retrieves the full GPU name as an ASCII string - for example, \"Quadro FX 1400\".\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 90\n!\n! \\return  NVAPI_ERROR or NVAPI_OK\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetFullName(
        hPhysicalGpu: NvPhysicalGpuHandle,
        szName: *mut ::std::os::raw::c_char,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns the PCI identifiers associated with this GPU.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 90\n!\n! \\param   DeviceId      The internal PCI device identifier for the GPU.\n! \\param   SubSystemId   The internal PCI subsystem identifier for the GPU.\n! \\param   RevisionId    The internal PCI device-specific revision identifier for the GPU.\n! \\param   ExtDeviceId   The external PCI device identifier for the GPU.\n!\n! \\retval  NVAPI_INVALID_ARGUMENT              hPhysicalGpu or an argument is NULL\n! \\retval  NVAPI_OK                            Arguments are populated with PCI identifiers\n! \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found\n! \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetPCIIdentifiers(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pDeviceId: *mut NvU32,
        pSubSystemId: *mut NvU32,
        pRevisionId: *mut NvU32,
        pExtDeviceId: *mut NvU32,
    ) -> NvAPI_Status;
}
pub const _NV_GPU_TYPE_NV_SYSTEM_TYPE_GPU_UNKNOWN: _NV_GPU_TYPE = 0;
#[doc = "!< Integrated GPU"]
pub const _NV_GPU_TYPE_NV_SYSTEM_TYPE_IGPU: _NV_GPU_TYPE = 1;
#[doc = "!< Discrete GPU"]
pub const _NV_GPU_TYPE_NV_SYSTEM_TYPE_DGPU: _NV_GPU_TYPE = 2;
#[doc = "! \\ingroup gpu\n! Used in NvAPI_GPU_GetGPUType()."]
pub type _NV_GPU_TYPE = ::std::os::raw::c_int;
#[doc = "! \\ingroup gpu\n! Used in NvAPI_GPU_GetGPUType()."]
pub use self::_NV_GPU_TYPE as NV_GPU_TYPE;
extern "C" {
    #[doc = "!  DESCRIPTION: This function returns the GPU type (integrated or discrete).\n!               See ::NV_GPU_TYPE.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 173\n!\n! \\retval  NVAPI_INVALID_ARGUMENT              hPhysicalGpu\n! \\retval  NVAPI_OK                           *pGpuType contains the GPU type\n! \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found\n! \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE: hPhysicalGpu was not a physical GPU handle\n!\n!  \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetGPUType(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pGpuType: *mut NV_GPU_TYPE,
    ) -> NvAPI_Status;
}
pub const _NV_GPU_BUS_TYPE_NVAPI_GPU_BUS_TYPE_UNDEFINED: _NV_GPU_BUS_TYPE = 0;
pub const _NV_GPU_BUS_TYPE_NVAPI_GPU_BUS_TYPE_PCI: _NV_GPU_BUS_TYPE = 1;
pub const _NV_GPU_BUS_TYPE_NVAPI_GPU_BUS_TYPE_AGP: _NV_GPU_BUS_TYPE = 2;
pub const _NV_GPU_BUS_TYPE_NVAPI_GPU_BUS_TYPE_PCI_EXPRESS: _NV_GPU_BUS_TYPE = 3;
pub const _NV_GPU_BUS_TYPE_NVAPI_GPU_BUS_TYPE_FPCI: _NV_GPU_BUS_TYPE = 4;
pub const _NV_GPU_BUS_TYPE_NVAPI_GPU_BUS_TYPE_AXI: _NV_GPU_BUS_TYPE = 5;
#[doc = "! \\ingroup gpu\n! Used in NvAPI_GPU_GetBusType()"]
pub type _NV_GPU_BUS_TYPE = ::std::os::raw::c_int;
#[doc = "! \\ingroup gpu\n! Used in NvAPI_GPU_GetBusType()"]
pub use self::_NV_GPU_BUS_TYPE as NV_GPU_BUS_TYPE;
extern "C" {
    #[doc = "!  This function returns the type of bus associated with this GPU.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 90\n!\n! \\return      This API can return any of the error codes enumerated in #NvAPI_Status. If there are return error codes with\n!              specific meaning for this API, they are listed below.\n! \\retval      NVAPI_INVALID_ARGUMENT             hPhysicalGpu or pBusType is NULL.\n! \\retval      NVAPI_OK                          *pBusType contains bus identifier.\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetBusType(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pBusType: *mut NV_GPU_BUS_TYPE,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!   DESCRIPTION: Returns the ID of the bus associated with this GPU.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 167\n!\n!  \\retval  NVAPI_INVALID_ARGUMENT              hPhysicalGpu or pBusId is NULL.\n!  \\retval  NVAPI_OK                           *pBusId contains the bus ID.\n!  \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found.\n!  \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle.\n!\n!  \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetBusId(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pBusId: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!   DESCRIPTION: Returns the ID of the bus slot associated with this GPU.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 167\n!\n!  \\retval  NVAPI_INVALID_ARGUMENT              hPhysicalGpu or pBusSlotId is NULL.\n!  \\retval  NVAPI_OK                           *pBusSlotId contains the bus slot ID.\n!  \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found.\n!  \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle.\n!\n!  \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetBusSlotId(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pBusSlotId: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns the interrupt number associated with this GPU.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 90\n!\n! \\retval  NVAPI_INVALID_ARGUMENT              hPhysicalGpu or pIRQ is NULL.\n! \\retval  NVAPI_OK                           *pIRQ contains interrupt number.\n! \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found.\n! \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle.\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetIRQ(hPhysicalGpu: NvPhysicalGpuHandle, pIRQ: *mut NvU32) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns the revision of the video BIOS associated with this GPU.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 90\n!\n! \\retval    NVAPI_INVALID_ARGUMENT               hPhysicalGpu or pBiosRevision is NULL.\n! \\retval    NVAPI_OK                            *pBiosRevision contains revision number.\n! \\retval    NVAPI_NVIDIA_DEVICE_NOT_FOUND        No NVIDIA GPU driving a display was found.\n! \\retval    NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE   hPhysicalGpu was not a physical GPU handle.\n! \\ingroup   gpu\n"]
    pub fn NvAPI_GPU_GetVbiosRevision(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pBiosRevision: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns the OEM revision of the video BIOS associated with this GPU.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 90\n!\n! \\retval    NVAPI_INVALID_ARGUMENT              hPhysicalGpu or pBiosRevision is NULL\n! \\retval    NVAPI_OK                           *pBiosRevision contains revision number\n! \\retval    NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found\n! \\retval    NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle\n! \\ingroup   gpu\n"]
    pub fn NvAPI_GPU_GetVbiosOEMRevision(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pBiosRevision: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns the full video BIOS version string in the form of xx.xx.xx.xx.yy where\n!  - xx numbers come from NvAPI_GPU_GetVbiosRevision() and\n!  - yy comes from NvAPI_GPU_GetVbiosOEMRevision().\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 90\n!\n! \\retval   NVAPI_INVALID_ARGUMENT              hPhysicalGpu is NULL.\n! \\retval   NVAPI_OK                            szBiosRevision contains version string.\n! \\retval   NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found.\n! \\retval   NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle.\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetVbiosVersionString(
        hPhysicalGpu: NvPhysicalGpuHandle,
        szBiosRevision: *mut ::std::os::raw::c_char,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns the AGP aperture in megabytes.\n!\n! \\deprecated  Do not use this function - it is deprecated in release 455.\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 90\n!\n! \\retval   NVAPI_NOT_SUPPORTED\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetAGPAperture(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pSize: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns the current AGP Rate (0 = AGP not present, 1 = 1x, 2 = 2x, etc.).\n!\n! \\deprecated  Do not use this function - it is deprecated in release 455.\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 90\n!\n! \\retval   NVAPI_NOT_SUPPORTED\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetCurrentAGPRate(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pRate: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns the number of PCIE lanes being used for the PCIE interface\n!  downstream from the GPU.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 90\n!\n! \\retval  NVAPI_INVALID_ARGUMENT              pWidth is NULL.\n! \\retval  NVAPI_OK                            Call successful.\n! \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found.\n! \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle.\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetCurrentPCIEDownstreamWidth(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pWidth: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!   This function returns the physical size of framebuffer in KB.  This does NOT include any\n!   system RAM that may be dedicated for use by the GPU.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 90\n!\n! \\retval  NVAPI_INVALID_ARGUMENT              pSize is NULL\n! \\retval  NVAPI_OK                            Call successful\n! \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found\n! \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetPhysicalFrameBufferSize(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pSize: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns the virtual size of framebuffer in KB.  This includes the physical RAM plus any\n!  system RAM that has been dedicated for use by the GPU.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 90\n!\n! \\retval  NVAPI_INVALID_ARGUMENT              pSize is NULL.\n! \\retval  NVAPI_OK                            Call successful.\n! \\retval  NVAPI_NVIDIA_DEVICE_NOT_FOUND       No NVIDIA GPU driving a display was found.\n! \\retval  NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  hPhysicalGpu was not a physical GPU handle.\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetVirtualFrameBufferSize(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pSize: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function retrieves the Quadro status for the GPU (1 if Quadro, 0 if GeForce)\n!\n!  This API is deprecated and it is recommended to instead query\n!  NV_GPU_WORKSTATION_FEATURE_TYPE_PROVIZ support from the API\n!  NvAPI_GPU_QueryWorkstationFeatureSupport.\n! \\deprecated  Do not use this function - it is deprecated in release 460.\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! \\since Release: 80\n!\n! \\return  NVAPI_ERROR or NVAPI_OK\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetQuadroStatus(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pStatus: *mut NvU32,
    ) -> NvAPI_Status;
}
#[doc = "! \\ingroup gpu"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_BOARD_INFO {
    #[doc = "!< structure version"]
    pub version: NvU32,
    #[doc = "!< Board Serial Number"]
    pub BoardNum: [NvU8; 16usize],
}
#[test]
fn bindgen_test_layout__NV_BOARD_INFO() {
    const UNINIT: ::std::mem::MaybeUninit<_NV_BOARD_INFO> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_NV_BOARD_INFO>(),
        20usize,
        concat!("Size of: ", stringify!(_NV_BOARD_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_BOARD_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_BOARD_INFO))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_BOARD_INFO),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BoardNum) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_BOARD_INFO),
            "::",
            stringify!(BoardNum)
        )
    );
}
#[doc = "! \\ingroup gpu"]
pub type NV_BOARD_INFO_V1 = _NV_BOARD_INFO;
#[doc = "! \\ingroup gpu"]
pub type NV_BOARD_INFO = NV_BOARD_INFO_V1;
extern "C" {
    #[doc = "!   DESCRIPTION: This API Retrieves the Board information (a unique GPU Board Serial Number) stored in the InfoROM.\n!\n! \\param [in]      hPhysicalGpu       Physical GPU Handle.\n! \\param [in,out]  NV_BOARD_INFO      Board Information.\n!\n! TCC_SUPPORTED\n!\n! \\retval ::NVAPI_OK                     completed request\n! \\retval ::NVAPI_ERROR                  miscellaneous error occurred\n! \\retval ::NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE  handle passed is not a physical GPU handle\n! \\retval ::NVAPI_API_NOT_INTIALIZED            NVAPI not initialized\n! \\retval ::NVAPI_INVALID_POINTER               pBoardInfo is NULL\n! \\retval ::NVAPI_INCOMPATIBLE_STRUCT_VERSION   the version of the INFO struct is not supported\n!\n! \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetBoardInfo(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pBoardInfo: *mut NV_BOARD_INFO,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns the width of the GPU's RAM memory bus.\n!\n! SUPPORTED OS:  Windows 7 and higher\n!\n!\n! TCC_SUPPORTED\n!\n! \\since Release: 100\n!\n!  \\return NVAPI_ERROR or NVAPI_OK\n!  \\ingroup gpu\n"]
    pub fn NvAPI_GPU_GetRamBusWidth(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pBusWidth: *mut NvU32,
    ) -> NvAPI_Status;
}
#[doc = "! Used in NvAPI_GPU_GetArchInfo()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_GPU_ARCH_INFO_V1 {
    pub version: NvU32,
    pub architecture: NvU32,
    pub implementation: NvU32,
    pub revision: NvU32,
}
#[test]
fn bindgen_test_layout_NV_GPU_ARCH_INFO_V1() {
    const UNINIT: ::std::mem::MaybeUninit<NV_GPU_ARCH_INFO_V1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_ARCH_INFO_V1>(),
        16usize,
        concat!("Size of: ", stringify!(NV_GPU_ARCH_INFO_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_ARCH_INFO_V1>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_GPU_ARCH_INFO_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_ARCH_INFO_V1),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).architecture) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_ARCH_INFO_V1),
            "::",
            stringify!(architecture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implementation) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_ARCH_INFO_V1),
            "::",
            stringify!(implementation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).revision) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NV_GPU_ARCH_INFO_V1),
            "::",
            stringify!(revision)
        )
    );
}
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_T2X: _NV_GPU_ARCHITECTURE_ID = -536870880;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_T3X: _NV_GPU_ARCHITECTURE_ID = -536870864;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_T4X: _NV_GPU_ARCHITECTURE_ID = -536870848;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_T12X: _NV_GPU_ARCHITECTURE_ID = -536870848;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_NV40: _NV_GPU_ARCHITECTURE_ID = 64;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_NV50: _NV_GPU_ARCHITECTURE_ID = 80;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_G78: _NV_GPU_ARCHITECTURE_ID = 96;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_G80: _NV_GPU_ARCHITECTURE_ID = 128;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_G90: _NV_GPU_ARCHITECTURE_ID = 144;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_GT200: _NV_GPU_ARCHITECTURE_ID = 160;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_GF100: _NV_GPU_ARCHITECTURE_ID = 192;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_GF110: _NV_GPU_ARCHITECTURE_ID = 208;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_GK100: _NV_GPU_ARCHITECTURE_ID = 224;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_GK110: _NV_GPU_ARCHITECTURE_ID = 240;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_GK200: _NV_GPU_ARCHITECTURE_ID = 256;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_GM000: _NV_GPU_ARCHITECTURE_ID = 272;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_GM200: _NV_GPU_ARCHITECTURE_ID = 288;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_GP100: _NV_GPU_ARCHITECTURE_ID = 304;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_GV100: _NV_GPU_ARCHITECTURE_ID = 320;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_GV110: _NV_GPU_ARCHITECTURE_ID = 336;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_TU100: _NV_GPU_ARCHITECTURE_ID = 352;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_GA100: _NV_GPU_ARCHITECTURE_ID = 368;
pub const _NV_GPU_ARCHITECTURE_ID_NV_GPU_ARCHITECTURE_AD100: _NV_GPU_ARCHITECTURE_ID = 400;
#[doc = "! NV_GPU_ARCH_INFO() values to identify Architecture level for the GPU."]
pub type _NV_GPU_ARCHITECTURE_ID = ::std::os::raw::c_int;
#[doc = "! NV_GPU_ARCH_INFO() values to identify Architecture level for the GPU."]
pub use self::_NV_GPU_ARCHITECTURE_ID as NV_GPU_ARCHITECTURE_ID;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_T20:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 0;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_T30:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 0;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_T35:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 5;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_T40:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 0;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_T124:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 0;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV40:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 0;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV41:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 1;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV42:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 2;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV43:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 3;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV44:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 4;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV44A:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 10;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV46:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 6;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV47:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 7;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV49:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 9;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV4B:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 11;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV4C:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 12;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV4E:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 14;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV50:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 0;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV63:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 3;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_NV67:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 7;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_G84:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 4;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_G86:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 6;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_G92:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 2;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_G94:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 4;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_G96:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 6;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_G98:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 8;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_GT200:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 0;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_GT212:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 2;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_GT214:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 4;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_GT215:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 3;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_GT216:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 5;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_GT218:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 8;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_MCP77:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 10;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_GT21C:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 11;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_MCP79:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 12;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_GT21A:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 13;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_MCP89:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 15;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_GF100:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 0;
pub const _NV_GPU_ARCH_IMPLEMENTATION_ID_NV_GPU_ARCH_IMPLEMENTATION_GF104:
    _NV_GPU_ARCH_IMPLEMENTATION_ID = 4;
